YP-LXL/my-project/src/driver/gd32f4x.c

#include "gd32f4x.h"

const uint8_t CRC8Table[]=
{			
	0x00,0x07,0x0E,0x09,0x1C,0x1B,0x12,0x15,0x38,0x3F,0x36,0x31,0x24,0x23,0x2A,0x2D,
	0x70,0x77,0x7E,0x79,0x6C,0x6B,0x62,0x65,0x48,0x4F,0x46,0x41,0x54,0x53,0x5A,0x5D,
	0xE0,0xE7,0xEE,0xE9,0xFC,0xFB,0xF2,0xF5,0xD8,0xDF,0xD6,0xD1,0xC4,0xC3,0xCA,0xCD,
	0x90,0x97,0x9E,0x99,0x8C,0x8B,0x82,0x85,0xA8,0xAF,0xA6,0xA1,0xB4,0xB3,0xBA,0xBD,
	0xC7,0xC0,0xC9,0xCE,0xDB,0xDC,0xD5,0xD2,0xFF,0xF8,0xF1,0xF6,0xE3,0xE4,0xED,0xEA,
	0xB7,0xB0,0xB9,0xBE,0xAB,0xAC,0xA5,0xA2,0x8F,0x88,0x81,0x86,0x93,0x94,0x9D,0x9A,
	0x27,0x20,0x29,0x2E,0x3B,0x3C,0x35,0x32,0x1F,0x18,0x11,0x16,0x03,0x04,0x0D,0x0A,
	0x57,0x50,0x59,0x5E,0x4B,0x4C,0x45,0x42,0x6F,0x68,0x61,0x66,0x73,0x74,0x7D,0x7A,
	0x89,0x8E,0x87,0x80,0x95,0x92,0x9B,0x9C,0xB1,0xB6,0xBF,0xB8,0xAD,0xAA,0xA3,0xA4,
	0xF9,0xFE,0xF7,0xF0,0xE5,0xE2,0xEB,0xEC,0xC1,0xC6,0xCF,0xC8,0xDD,0xDA,0xD3,0xD4,
	0x69,0x6E,0x67,0x60,0x75,0x72,0x7B,0x7C,0x51,0x56,0x5F,0x58,0x4D,0x4A,0x43,0x44,
	0x19,0x1E,0x17,0x10,0x05,0x02,0x0B,0x0C,0x21,0x26,0x2F,0x28,0x3D,0x3A,0x33,0x34,
	0x4E,0x49,0x40,0x47,0x52,0x55,0x5C,0x5B,0x76,0x71,0x78,0x7F,0x6A,0x6D,0x64,0x63,
	0x3E,0x39,0x30,0x37,0x22,0x25,0x2C,0x2B,0x06,0x01,0x08,0x0F,0x1A,0x1D,0x14,0x13,
	0xAE,0xA9,0xA0,0xA7,0xB2,0xB5,0xBC,0xBB,0x96,0x91,0x98,0x9F,0x8A,0x8D,0x84,0x83,
	0xDE,0xD9,0xD0,0xD7,0xC2,0xC5,0xCC,0xCB,0xE6,0xE1,0xE8,0xEF,0xFA,0xFD,0xF4,0xF3
};

/*CRC高位字节值表*/
const unsigned int ExternalCommRxA_CRCTable_high[] =
{
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
    0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
    0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
    0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
    0x80, 0x41, 0x00, 0xC1, 0x81, 0x40
};

/*CRC低位字节值表*/
const unsigned int ExternalCommRxA_CRCTable_low[] =
{
    0x00, 0xC0, 0xC1, 0x01, 0xC3, 0x03, 0x02, 0xC2, 0xC6, 0x06,
    0x07, 0xC7, 0x05, 0xC5, 0xC4, 0x04, 0xCC, 0x0C, 0x0D, 0xCD,
    0x0F, 0xCF, 0xCE, 0x0E, 0x0A, 0xCA, 0xCB, 0x0B, 0xC9, 0x09,
    0x08, 0xC8, 0xD8, 0x18, 0x19, 0xD9, 0x1B, 0xDB, 0xDA, 0x1A,
    0x1E, 0xDE, 0xDF, 0x1F, 0xDD, 0x1D, 0x1C, 0xDC, 0x14, 0xD4,
    0xD5, 0x15, 0xD7, 0x17, 0x16, 0xD6, 0xD2, 0x12, 0x13, 0xD3,
    0x11, 0xD1, 0xD0, 0x10, 0xF0, 0x30, 0x31, 0xF1, 0x33, 0xF3,
    0xF2, 0x32, 0x36, 0xF6, 0xF7, 0x37, 0xF5, 0x35, 0x34, 0xF4,
    0x3C, 0xFC, 0xFD, 0x3D, 0xFF, 0x3F, 0x3E, 0xFE, 0xFA, 0x3A,
    0x3B, 0xFB, 0x39, 0xF9, 0xF8, 0x38, 0x28, 0xE8, 0xE9, 0x29,
    0xEB, 0x2B, 0x2A, 0xEA, 0xEE, 0x2E, 0x2F, 0xEF, 0x2D, 0xED,
    0xEC, 0x2C, 0xE4, 0x24, 0x25, 0xE5, 0x27, 0xE7, 0xE6, 0x26,
    0x22, 0xE2, 0xE3, 0x23, 0xE1, 0x21, 0x20, 0xE0, 0xA0, 0x60,
    0x61, 0xA1, 0x63, 0xA3, 0xA2, 0x62, 0x66, 0xA6, 0xA7, 0x67,
    0xA5, 0x65, 0x64, 0xA4, 0x6C, 0xAC, 0xAD, 0x6D, 0xAF, 0x6F,
    0x6E, 0xAE, 0xAA, 0x6A, 0x6B, 0xAB, 0x69, 0xA9, 0xA8, 0x68,
    0x78, 0xB8, 0xB9, 0x79, 0xBB, 0x7B, 0x7A, 0xBA, 0xBE, 0x7E,
    0x7F, 0xBF, 0x7D, 0xBD, 0xBC, 0x7C, 0xB4, 0x74, 0x75, 0xB5,
    0x77, 0xB7, 0xB6, 0x76, 0x72, 0xB2, 0xB3, 0x73, 0xB1, 0x71,
    0x70, 0xB0, 0x50, 0x90, 0x91, 0x51, 0x93, 0x53, 0x52, 0x92,
    0x96, 0x56, 0x57, 0x97, 0x55, 0x95, 0x94, 0x54, 0x9C, 0x5C,
    0x5D, 0x9D, 0x5F, 0x9F, 0x9E, 0x5E, 0x5A, 0x9A, 0x9B, 0x5B,
    0x99, 0x59, 0x58, 0x98, 0x88, 0x48, 0x49, 0x89, 0x4B, 0x8B,
    0x8A, 0x4A, 0x4E, 0x8E, 0x8F, 0x4F, 0x8D, 0x4D, 0x4C, 0x8C,
    0x44, 0x84, 0x85, 0x45, 0x87, 0x47, 0x46, 0x86, 0x82, 0x42,
    0x43, 0x83, 0x41, 0x81, 0x80, 0x40
};


volatile uint8_t  Usart0TxBuff[USART2_TXBUFF_COUNT_MAX] = {0};	/*串口0的数据发送缓冲区*/
uint8_t  Usart0RxBuff[USART0_RXBUFF_COUNT_MAX] = {0};			/*串口0的数据接收缓冲区*/

volatile static uint16_t Usart0RxNum = 0;						/*串口0接收到的数据个数*/

volatile uint8_t  Usart2TxBuff[USART2_TXBUFF_COUNT_MAX] = {0};	/*串口2的数据发送缓冲区*/
uint8_t  Usart2RxBuff[USART2_RXBUFF_COUNT_MAX] = {0};			/*串口2的数据接收缓冲区*/

volatile static uint16_t Usart2RxNum = 0;						/*串口2接收到的数据个数*/

/* volatile uint8_t  Uart3TxBuff[UART3_TXBUFF_COUNT_MAX] = {0};*/	/*串口3的数据发送缓冲区*/
uint8_t  Uart3RxBuff[UART3_RXBUFF_COUNT_MAX] = {0};			    /*串口3的数据接收缓冲区*/

volatile static uint16_t Uart3RxNum = 0;						/*串口3接收到的数据个数*/

uint32_t uiDMAData[DMA1_CH0_BUFF_MAX] ={0};			            /*存储DMA数据 ADC用*/

/* 系统时钟************************************************************************** */
/* us延时倍乘数 */
static uint32_t g_fac_us = 0; 

/**
 * @函数名称: delay_init()
 * @功能描述: 精准延时函数初始化
 * @输入: sysclk: 系统时钟频率, 即CPU频率(rcc_c_ck) 200Mhz
 * @输出: 无
 * @返回值: 无
 */
static void gd32f4x_delay_init(uint16_t sysclk)
{
    uint32_t reload;
    /* SYSTICK使用内核时钟源,同CPU同频率 */
    systick_clksource_set(SYSTICK_CLKSOURCE_HCLK);
    /* 不论是否使用OS,g_fac_us都需要使用 */
    g_fac_us = sysclk;
    /* 每秒钟的计数次数 单位为M */
    reload = sysclk;
    /* 根据delay_ostickspersec设定溢出时间,reload为24位
    寄存器,最大值:16777216,在168M下,约合0.099s左右 */
    reload *= 1000000 / configTICK_RATE_HZ;
    /* 开启SYSTICK中断 */
    SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;  
    /* 每1/delay_ostickspersec秒中断一次 */
    SysTick->LOAD = reload;
    /* 开启SYSTICK */
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
}

/**
 * @函数名称: delay_us()
 * @功能描述: 微秒延时接口
 * @输入: nus 微秒计数
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_delay_us(uint32_t nus)
{
    uint32_t ticks;
    uint32_t told, tnow, tcnt = 0;
    /* LOAD的值 */
    uint32_t reload = SysTick->LOAD;
    /* 需要的节拍数 */
    ticks = nus * g_fac_us;
    /* 刚进入时的计数器值 */
    told = SysTick->VAL;
    while (1) {
        tnow = SysTick->VAL;
        if (tnow != told) {
            if (tnow < told) {
                /* 这里注意一下SYSTICK是一个递减的计数器就可以了 */
                tcnt += told - tnow;
            }
            else {
                tcnt += reload - tnow + told;
            }
            told = tnow;
            if (tcnt >= ticks) {
                /* 时间超过/等于要延迟的时间,则退出 */
                break;
            }
        }
    }
}

/**
 * @函数名称: gd32f4x_delay_ms()
 * @功能描述: 毫秒延时接口
 * @输入: ms 毫秒计数
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_delay_ms(uint16_t nms)
{
    uint32_t i;
    for (i = 0; i < nms; i++) {
        gd32f4x_delay_us(1000);
    }
}

/**
 * @函数名称: system_clock_init()
 * @功能描述: 系统时钟初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_system_clock_init(void)
{
    /* 设置系统时钟200MHz */
    SystemInit();
    /* 延时函数初始化 */
    gd32f4x_delay_init(200);
}

/* 服务FreeRTOS定时器中断（除了自动执行的端口）*/
extern void xPortSysTickHandler(void);
void SysTick_Handler(void) 
{     
    #if (INCLUDE_xTaskGetSchedulerState  == 1 )      
    if(xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {   
        #endif        
        xPortSysTickHandler();   
        #if (INCLUDE_xTaskGetSchedulerState  == 1 )     
    }
    #endif  
}

/* IO-输入/输出************************************************************************** */
/**
 * @函数名称: gpio_init()
 * @功能描述: gpio初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_gpio_init(void)
{
    gpio_deinit(GPIOA);
	gpio_deinit(GPIOB);
	gpio_deinit(GPIOC);
	gpio_deinit(GPIOD);
	gpio_deinit(GPIOE);
	/*复位外部中断*/ 
	exti_deinit();
    /*使能外部中断时钟*/
	rcu_periph_clock_enable(RCU_SYSCFG);
	 
	 /*****************************************GPIOA初始化*******************************************/
    /*使能GPIOA时钟*/
	rcu_periph_clock_enable(RCU_GPIOA);
	
	/*wkup待机模式下按键唤醒功能*/
	gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_MODE_AF, GPIO_PIN_0);/*设置PA0的工作模式为备用功能模式*/
	pmu_wakeup_pin_enable();/*使能PA0的wkup功能*/
	
