YP-LXL/my-project/src/driver/gd32f4x.c
	/*
	  *@ EN_SW1置高,Vbat开始给板卡通电,辅电工作
	 */
	gpio_mode_set(EN_SW1_APS_VBT_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,EN_SW1_APS_VBT_PIN);/*设置工作模式，输入还是输出*/
	gpio_output_options_set(EN_SW1_APS_VBT_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,EN_SW1_APS_VBT_PIN);/*输出模式，推挽输出*/
	gpio_bit_reset(EN_SW1_APS_VBT_GPIO,EN_SW1_APS_VBT_PIN);/*输出高电平*/
	
	/*
	  *@ EN_SW2置高,Vbat开始防反接电路工作
	 */
	gpio_mode_set(EN_SW2_ARC_VBT_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,EN_SW2_ARC_VBT_PIN);
	gpio_output_options_set(EN_SW2_ARC_VBT_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,EN_SW2_ARC_VBT_PIN);
	gpio_bit_reset(EN_SW2_ARC_VBT_GPIO,EN_SW2_ARC_VBT_PIN);
	
	/*
	  *@ CAN,485通讯芯片供电电源开关,高电平使能输出,低电平关闭输出
	 */
	gpio_mode_set(PERIPHERAL_POWER_VDD_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,PERIPHERAL_POWER_VDD_PIN);
	gpio_output_options_set(PERIPHERAL_POWER_VDD_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,PERIPHERAL_POWER_VDD_PIN);
	gpio_bit_reset(PERIPHERAL_POWER_VDD_GPIO,PERIPHERAL_POWER_VDD_PIN);

    /*
	  *@ LED 7 
	 */
	gpio_mode_set(LED_J49_7_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,LED_J49_7_PIN);
	gpio_output_options_set(LED_J49_7_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,LED_J49_7_PIN);
	gpio_bit_reset(LED_J49_7_GPIO,LED_J49_7_PIN);

	 /*****************************************GPIOB初始化*******************************************/
	rcu_periph_clock_enable(RCU_GPIOB);
	
	/*
	  *@ 蜂鸣器
	 */
	gpio_mode_set(BUZZER_PORT,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,BUZZER_PIN);
	gpio_output_options_set(BUZZER_PORT,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,BUZZER_PIN);
	gpio_bit_reset(BUZZER_PORT,BUZZER_PIN);
    
	/*
	  *@ J4的EH_DCH，EN_DCH置高，低压Vbat驱动端开始工作，升压输出
	 */
	gpio_mode_set(LOW_VOLTAGE_DRIVE_EN_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,LOW_VOLTAGE_DRIVE_EN_PIN);
	gpio_output_options_set(LOW_VOLTAGE_DRIVE_EN_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,LOW_VOLTAGE_DRIVE_EN_PIN);
	gpio_bit_reset(LOW_VOLTAGE_DRIVE_EN_GPIO,LOW_VOLTAGE_DRIVE_EN_PIN);
	
	/*
	  *@ RS485(/RE)收发器的接收使能引脚
	 */
	gpio_mode_set(PERIPHERAL_RS485_EN_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,PERIPHERAL_RS485_EN_PIN);
	gpio_output_options_set(PERIPHERAL_RS485_EN_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,PERIPHERAL_RS485_EN_PIN);
	gpio_bit_set(PERIPHERAL_RS485_EN_GPIO,PERIPHERAL_RS485_EN_PIN);

	
	 
	 /*****************************************GPIOC初始化*******************************************/ 
	rcu_periph_clock_enable(RCU_GPIOC);
	
	/*
	  *@ 12V转8V电源VPRO的供电使能输出,VPRO的供电使能,常低,拉高延时1s供电
	 */
	gpio_mode_set(VPRO12V8V_CONTROL_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,VPRO12V8V_CONTROL_PIN);
	gpio_output_options_set(VPRO12V8V_CONTROL_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,VPRO12V8V_CONTROL_PIN);
	gpio_bit_set(VPRO12V8V_CONTROL_GPIO,VPRO12V8V_CONTROL_PIN);

	/*
	  *@ 输入,J4的S_HV,高压存在后,S_HV=0,母线没高压S_HV=1；
	 */
	gpio_mode_set(BUS_HIGH_VOLTAGE_STATE_GPIO,GPIO_MODE_INPUT,GPIO_PUPD_PULLUP,BUS_HIGH_VOLTAGE_STATE_PIN);
	
	nvic_irq_enable(EXTI5_9_IRQn, 2u, 2u);
	syscfg_exti_line_config(EXTI_SOURCE_GPIOC, EXTI_SOURCE_PIN5);
	exti_init(BUS_HIGH_VOLTAGE_EXTI_X, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
	exti_interrupt_enable(BUS_HIGH_VOLTAGE_EXTI_X);
	exti_interrupt_flag_clear(BUS_HIGH_VOLTAGE_EXTI_X);

    /*
	  *@ 输入,插入检测 当外部给SL0_IN,高电平时,也就是插入后,你读取MS0就是高电平
	 */
	gpio_mode_set(MS0_DET_STATE_GPIO,GPIO_MODE_INPUT,GPIO_PUPD_PULLDOWN,MS0_DET_STATE_PIN);

    nvic_irq_enable(EXTI5_9_IRQn, 2u, 1u);
	syscfg_exti_line_config(EXTI_SOURCE_GPIOC, EXTI_SOURCE_PIN7);
	exti_init(MS0_DET_EXTI_X, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_interrupt_enable(MS0_DET_EXTI_X);
	exti_interrupt_flag_clear(MS0_DET_EXTI_X);

	/*
	  *@ 输出，发出插入信号
	 */
	gpio_mode_set(MS0_OUT_EN_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,MS0_OUT_EN_PIN);
	gpio_output_options_set(MS0_OUT_EN_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,MS0_OUT_EN_PIN);
	gpio_bit_set(MS0_OUT_EN_GPIO,MS0_OUT_EN_PIN);

    /*
	  *@ 输出，LED6
	 */
    gpio_mode_set(LED_J49_6_GPIO, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED_J49_6_PIN);
    gpio_output_options_set(LED_J49_6_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, LED_J49_6_PIN);
    gpio_bit_reset(LED_J49_6_GPIO,LED_J49_6_PIN);

	 /*****************************************GPIOD初始化*******************************************/ 
	rcu_periph_clock_enable(RCU_GPIOD);
		
	/*
	  *@ CTL 充放电和预充MOS强制关闭
	 */
	gpio_mode_set(AFESH367309MOS_CONTR_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,AFESH367309MOS_CONTR_PIN);
	gpio_output_options_set(AFESH367309MOS_CONTR_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,AFESH367309MOS_CONTR_PIN);
	gpio_bit_set(AFESH367309MOS_CONTR_GPIO,AFESH367309MOS_CONTR_PIN); 	
	
	/*
	  *@ ALARM AFE芯片与MCU通信引脚，中断方式
	 */	
	gpio_mode_set(AFE_SH367309_ALARM_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, AFE_SH367309_ALARM_PIN);
	nvic_irq_enable(EXTI10_15_IRQn, 2u, 1u);
	syscfg_exti_line_config(EXTI_SOURCE_GPIOD, EXTI_SOURCE_PIN15);
	exti_init(ALARM_GPIO_EXTI_X, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
	exti_interrupt_enable(ALARM_GPIO_EXTI_X);
	exti_interrupt_flag_clear(ALARM_GPIO_EXTI_X);

	/*
	  *@ SHIP 仓运初始化
	 */
	gpio_mode_set(WAREHOUSE_STAT_CONTR_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,WAREHOUSE_STAT_CONTR_PIN);
	gpio_output_options_set(WAREHOUSE_STAT_CONTR_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,WAREHOUSE_STAT_CONTR_PIN);
	gpio_bit_set(WAREHOUSE_STAT_CONTR_GPIO,WAREHOUSE_STAT_CONTR_PIN);
	
	 /*****************************************GPIOE初始化*******************************************/
	rcu_periph_clock_enable(RCU_GPIOE);
	
	/*
	  *@ EN_SKY：开机按钮按下检测功能，开机按钮按下EN_SKY=0,没按下EN_SKY=1
	 */	
	gpio_mode_set(EN_SKY_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, EN_SKY_PIN);
	nvic_irq_enable(EXTI2_IRQn, 2u, 1u);
	syscfg_exti_line_config(EXTI_SOURCE_GPIOE, EXTI_SOURCE_PIN2);
	exti_init(EN_SKY_EXTI_X, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
	exti_interrupt_enable(EN_SKY_EXTI_X);
	exti_interrupt_flag_clear(EN_SKY_EXTI_X);

	/*
	  *@ EN_PWR：当开机按钮按下后辅电供电，系统自检OK后EN_PWRs输出1高，保持辅电一直提供
	 */	
	gpio_mode_set(EN_PWR_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,EN_PWR_PIN);
	gpio_output_options_set(EN_PWR_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,EN_PWR_PIN);
	gpio_bit_reset(EN_PWR_GPIO,EN_PWR_PIN);

	/*
	  *@ 输出，J4的EH_CH，EN_CH置高，高压驱动端开始工作，降压输出
	 */
	gpio_mode_set(HIGH_VOLTAGE_DRIVE_EN_GPIO,GPIO_MODE_OUTPUT,GPIO_PUPD_NONE,HIGH_VOLTAGE_DRIVE_EN_PIN);
	gpio_output_options_set(HIGH_VOLTAGE_DRIVE_EN_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,HIGH_VOLTAGE_DRIVE_EN_PIN);
	gpio_bit_reset(HIGH_VOLTAGE_DRIVE_EN_GPIO,HIGH_VOLTAGE_DRIVE_EN_PIN);
}

/* afe alarm中断处理函数 */
afe_alarm_interrupt_callback afe_alarm_handle = NULL;

/**
 * @函数名称: gd32f4x_gpio_set_afe_alarm_callback()
 * @功能描述: 注册afe alarm中断回调处理函数
 * @输入: alarm_calback 中断回调处理函数
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_gpio_set_afe_alarm_callback(afe_alarm_interrupt_callback alarm_calback)
{
    if (NULL != alarm_calback) {
        afe_alarm_handle = alarm_calback;
    }
}

void gd32f4x_afe_alarm_irq_enable(void)
{
    exti_interrupt_enable(ALARM_GPIO_EXTI_X);
}

void gd32f4x_afe_alarm_irq_disable(void)
{
    exti_interrupt_disable(ALARM_GPIO_EXTI_X);
}

