YP-LXL/my-project/src/driver/gd32f4x.c
void gd32f4x_bus_high_voltage_irq_enable(void)
{
    exti_interrupt_enable(BUS_HIGH_VOLTAGE_EXTI_X);
}

void gd32f4x_bus_high_voltage_irq_disable(void)
{
    exti_interrupt_disable(BUS_HIGH_VOLTAGE_EXTI_X);
}


void gd32f4x_sky_irq_enable(void)
{
    exti_interrupt_enable(EN_SKY_EXTI_X);
}

void gd32f4x_sky_irq_disable(void)
{
    exti_interrupt_disable(EN_SKY_EXTI_X);
}

void gd32f4x_input_irq_enable(void)
{
    exti_interrupt_enable(MS0_DET_EXTI_X);
}

void gd32f4x_input_irq_disable(void)
{
    exti_interrupt_disable(MS0_DET_EXTI_X);
}
/**
 * @函数名称: gd32f4x_key_read()
 * @功能描述: 按键读取
 * @输入: 无
 * @输出: 无
 * @返回值: 电平0 1 
 */
uint8_t gd32f4x_key_read(void)
{
    if(0 == gpio_input_bit_get(EN_SKY_GPIO, EN_SKY_PIN)) {

        return 0;
    }
    return 1;
}


/* AFE告警触发的外部中断函数 */
void EXTI10_15_IRQHandler(void)
{
	uint32_t ulReturn;
    /* 进入临界代码段，让系统管理中断 */
    ulReturn = taskENTER_CRITICAL_FROM_ISR();
    if (exti_interrupt_flag_get(ALARM_GPIO_EXTI_X) == SET) {

        /* 处理告警的回调函数 */
        if (afe_alarm_handle != NULL) {
            /* 中断回调函数 */
            afe_alarm_handle();
        }
        // DRIVER_LOG(" ALARM INPUT \r\n ");
        exti_interrupt_flag_clear(ALARM_GPIO_EXTI_X);
    }
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}


uint32_t exitirq_count = 0;
/* 母线电压检测的外部中断函数 以及后面添加的输入检测 */
void EXTI5_9_IRQHandler(void)
{
	uint32_t ulReturn;
	ulReturn = taskENTER_CRITICAL_FROM_ISR();
	if(exti_interrupt_flag_get(BUS_HIGH_VOLTAGE_EXTI_X) == SET)
	{
        // DRIVER_LOG("BUS_HIGH_VOLTAGE_EXTI_X INPUT\r\n");
        exitirq_count++;
		exti_interrupt_flag_clear(BUS_HIGH_VOLTAGE_EXTI_X);
	}
	if(exti_interrupt_flag_get(MS0_DET_EXTI_X) == SET)
	{
        // DRIVER_LOG("MS0_DET_EXTI_X INPUT\r\n");
		exti_interrupt_flag_clear(MS0_DET_EXTI_X);
	}
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}

/* 串口调试************************************************************************** */
/**
 * @函数名称: usart0_init()
 * @功能描述: usart0初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_usart0_init(uint32_t baudrate) 
{
    rcu_periph_clock_enable(RCU_USART2);  /* 使能串口0的时钟*/
    rcu_periph_clock_enable(RCU_GPIOC);
    /* 接收引脚配置*/
    gpio_mode_set(USART0_RX_GPIO, GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART0_RX_PIN);  
    /*	gpio_output_options_set(USART5_RX_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,USART5_RX_PIN);*/
    /*设置GPIO输出模式和速度*/
    gpio_af_set(USART0_RX_GPIO, GPIO_AF_7, USART0_RX_PIN);  

    /* 发送引脚配置*/
    gpio_mode_set(USART0_TX_GPIO, GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART0_TX_PIN); 
    gpio_output_options_set(USART0_TX_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);  
    gpio_af_set(USART0_TX_GPIO, GPIO_AF_7, USART0_TX_PIN);  

    usart_deinit(USART2);                             
    usart_oversample_config(USART2, USART_OVSMOD_8);  
    usart_baudrate_set(USART2, baudrate);            
    usart_word_length_set(USART2, USART_WL_8BIT); 
    usart_stop_bit_set(USART2, USART_STB_1BIT);   
    usart_parity_config(USART2, USART_PM_NONE);    

    usart_transmit_config(USART2, USART_TRANSMIT_ENABLE);  
    usart_receive_config(USART2, USART_RECEIVE_ENABLE);   
    usart_enable(USART2);                                 

    usart_dma_receive_config(USART2, USART_DENR_ENABLE); 
    usart_dma_transmit_config(USART2, USART_DENT_ENABLE); 

    usart_interrupt_enable(USART2, USART_INT_IDLE);  
    /*	usart_interrupt_enable(USART0, USART_INT_TBE);*/
    

    nvic_irq_enable(USART2_IRQn, 2, 3);  
}

/* 串口调试************************************************************************** */
/**
 * @函数名称: usart2_init()
 * @功能描述: usart2初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_usart2_init(uint32_t baudrate) 
{
    rcu_periph_clock_enable(RCU_USART2);  
    rcu_periph_clock_enable(RCU_GPIOD);   
    /* 接收引脚配置*/
    gpio_mode_set(USART2_RX_GPIO, GPIO_MODE_AF, GPIO_PUPD_PULLUP,USART2_RX_PIN);  /* 配置串口2的RX引脚复用功能，上拉输入*/
    /*	gpio_output_options_set(USART2_RX_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,USART2_RX_PIN);*/
    /*设置GPIO输出模式和速度*/
    gpio_af_set(USART2_RX_GPIO, GPIO_AF_7, USART2_RX_PIN); 

    /* 发送引脚配置*/
    gpio_mode_set(USART2_TX_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, USART2_TX_PIN); 
    gpio_output_options_set(USART2_TX_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART2_TX_PIN);  
    gpio_af_set(USART2_TX_GPIO, GPIO_AF_7, USART2_TX_PIN);  

    usart_deinit(USART2);                          
    usart_oversample_config(USART2, USART_OVSMOD_8); 
    usart_baudrate_set(USART2, baudrate);             
    usart_word_length_set(USART2, USART_WL_8BIT);  
    usart_stop_bit_set(USART2, USART_STB_1BIT);    
    usart_parity_config(USART2, USART_PM_NONE);   

    usart_transmit_config(USART2, USART_TRANSMIT_ENABLE);  
    usart_receive_config(USART2, USART_RECEIVE_ENABLE);    
    usart_enable(USART2);                                 

    usart_dma_receive_config(USART2, USART_DENR_ENABLE); 
    usart_dma_transmit_config(USART2, USART_DENT_ENABLE); 

    usart_flag_clear(USART2, USART_FLAG_TC);
    usart_flag_clear(USART2, USART_INT_IDLE);
    usart_interrupt_enable(USART2, USART_INT_IDLE);
    /*	usart_interrupt_enable(USART2, USART_INT_TBE);*/
  

    nvic_irq_enable(USART2_IRQn, 2, 4); 
                       
}

/* 串口调试************************************************************************** */
/**
 * @函数名称: usart3_init()
 * @功能描述: usart3初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_uart3_init(uint32_t baudrate)
{
    rcu_periph_clock_enable(RCU_UART3);
    rcu_periph_clock_enable(RCU_GPIOC); 
    /* 接收引脚配置*/
    gpio_mode_set(UART3_RX_GPIO, GPIO_MODE_AF, GPIO_PUPD_PULLUP, UART3_RX_PIN);  /* 配置串口2的RX引脚复用功能，上拉输入*/
    /*	gpio_output_options_set(USART2_RX_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,USART3_RX_PIN);*/
    /*设置GPIO输出模式和速度*/
    gpio_af_set(UART3_RX_GPIO, GPIO_AF_8, UART3_RX_PIN);  

    /*发送引脚配置*/
    gpio_mode_set(UART3_TX_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, UART3_TX_PIN); 
    gpio_output_options_set(UART3_TX_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, UART3_TX_PIN); 
    gpio_af_set(UART3_TX_GPIO, GPIO_AF_8, UART3_TX_PIN);

