YP-LXL/my-project/src/driver/gd32f4x.c
    usart_deinit(UART3);                            
    usart_oversample_config(UART3, USART_OVSMOD_8); 
    usart_baudrate_set(UART3, baudrate);          
    usart_word_length_set(UART3, USART_WL_8BIT);
    usart_stop_bit_set(UART3, USART_STB_1BIT);
    usart_parity_config(UART3, USART_PM_NONE);

    usart_transmit_config(UART3, USART_TRANSMIT_ENABLE);
    usart_receive_config(UART3, USART_RECEIVE_ENABLE);   
    usart_enable(UART3);                                

    usart_dma_receive_config(UART3, USART_DENR_ENABLE); 
    usart_dma_transmit_config(UART3, USART_DENT_ENABLE);
    usart_flag_clear(UART3, USART_FLAG_TC);

    usart_interrupt_enable(UART3, USART_INT_IDLE);
    usart_interrupt_enable(UART3, USART_INT_RBNE);

    nvic_irq_enable(UART3_IRQn, 2, 4); 
                    
                     
}

void gd32f4x_usart0_enable(void)
{
    usart_enable(USART0);
}

void gd32f4x_usart0_disable(void)
{
    usart_disable(USART0);
}

void gd32f4x_usart2_enable(void)
{
    usart_enable(USART2);
}

void gd32f4x_usart2_disable(void)
{
    usart_disable(USART2);
}

void gd32f4x_uart3_enable(void)
{
    usart_enable(UART3);
}

void gd32f4x_uart3_disable(void)
{
    usart_disable(UART3);
}

/* 串口调试************************************************************************** */
/**
 * @函数名称: usart_init()
 * @功能描述: usart初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_usart_init(void) 
{
    gd32f4x_usart0_init(115200); 
	//gd32f4x_usart2_init(9600); 
	//gd32f4x_uart3_init(115200); 
}

/* 将gcc的C库printf函数重定向到USART */
int _write(int file, char* data, int len)
{
    if ((file != STDOUT_FILENO) && (file != STDERR_FILENO)) {
        errno = EBADF;
        return -1;
    }
    for (int i = 0; i < len; i++) {
        usart_data_transmit(USART2, (uint8_t)data[i]);
        while (RESET == usart_flag_get(USART2, USART_FLAG_TBE))
            ;
    }
    return len;
}

/* ************************************************************************** */
/**
 * @函数名称: usart0_send_data()
 * @功能描述: usart0发送一字节
 * @输入: ucch 要发送的数据
 * @输出: 无
 * @返回值: 无
 */
void usart0_send_data(uint8_t ucch)
{
	usart_data_transmit(USART0, (uint8_t)ucch);							 
	while(RESET == usart_flag_get(USART0, USART_FLAG_TBE));  
}

/* ************************************************************************** */
/**
 * @函数名称: usart0_send_string()
 * @功能描述: usart0发送字符串
 * @输入: data 要发送的数据的地址 len 要发送的数据长度
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t usart0_send_string(uint8_t *data, uint32_t len)     
{  
    usart_flag_clear(USART0, USART_FLAG_TC);

    dma_channel_disable(DMA1, DMA_CH7);
    dma_flag_clear(DMA1, DMA_CH7, DMA_FLAG_FTF);
    dma_memory_address_config(DMA1, DMA_CH7, DMA_MEMORY_0, (uint32_t)data);
    dma_transfer_number_config(DMA1, DMA_CH7, len);
    dma_channel_enable(DMA1, DMA_CH7);
    
    while (usart_flag_get(USART0, USART_FLAG_TC) != RESET);
    return 0; // 成功
}

/* ************************************************************************** */
/**
 * @函数名称: usart2_send_string()
 * @功能描述: usart2发送字节
 * @输入: ucch 要发送的数据
 * @输出: 无
 * @返回值: 无
 */
void usart2_send_data(uint8_t ucch)
{
	usart_data_transmit(USART2, (uint8_t)ucch);							 
	while(RESET == usart_flag_get(USART2, USART_FLAG_TBE));  
}

/* ************************************************************************** */
/**
 * @函数名称: usart2_send_string()
 * @功能描述: usart2发送字符串
 * @输入: data 要发送的数据的地址 len 要发送的数据长度
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t usart2_send_string(uint8_t *data, uint32_t len) 
{
    usart_flag_clear(USART2, USART_FLAG_TC);

    dma_channel_disable(DMA0, DMA_CH3);
    dma_flag_clear(DMA0, DMA_CH3, DMA_FLAG_FTF);
    dma_memory_address_config(DMA0, DMA_CH3, DMA_MEMORY_0, (uint32_t)data);
    dma_transfer_number_config(DMA0, DMA_CH3, len);
    dma_channel_enable(DMA0, DMA_CH3);
    
    while (usart_flag_get(USART2, USART_FLAG_TC) != RESET);
    return 0; // 成功
}

/* ************************************************************************** */
/**
 * @函数名称: usart3_send_string()
 * @功能描述: usart3发送字节
 * @输入: ucch 要发送的数据
 * @输出: 无
 * @返回值: 无
 */
void uart3_send_data(uint8_t ucch)    
{
	usart_data_transmit(UART3, (uint8_t)ucch);							 
	while(RESET == usart_flag_get(UART3, USART_FLAG_TBE));  
}

/* ************************************************************************** */
/**
 * @函数名称: usart3_send_string()
 * @功能描述: 串口3发送字符串数据函数
 * @输入: str 要发送的数据的地址 
 * @输出: 无
 * @返回值: 无
 */
void uart3_send_string(char *str) 
{
	while (*str) {
        while (usart_flag_get(UART3, USART_FLAG_TBE) == RESET); 
        usart_data_transmit(UART3, *str++);
    }
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_pc_communicate_rs485rxbuffadd()
 * @功能描述: 获取pc RS485接收缓冲区内的数据地址
 * @输入: 
 * @输出: 无
 * @返回值: 无
 */
uint8_t *gd32f4x_pc_communicate_rs485rxbuffadd(void)
{
	return Usart2RxBuff;
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_dcdc_communicate_rs485rxbuffadd()
 * @功能描述: 获取dcdc RS485接收缓冲区内的数据地址
 * @输入:  
 * @输出: 无
 * @返回值: 无
 */
uint8_t *gd32f4x_dcdc_communicate_rs485rxbuffadd(void)
{
	return Usart0RxBuff;
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_dcdc_communicate_rxbuffnumber()
 * @功能描述: 获取串口0接收的到的数据个数
 * @输入: 
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_dcdc_communicate_rxbuffnumber(uint16_t BuffNum)
{
	Usart0RxNum = BuffNum;
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_pc_communicate_rxbuffnumber()
 * @功能描述: 获取串口2接收的到的数据个数
 * @输入: 
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_pc_communicate_rxbuffnumber(uint16_t BuffNum)
{
	Usart2RxNum = BuffNum;
}

void gd32f4x_dcdc_communicate_txbuff(uint8_t *TxBuff,uint16_t BuffNum)
{
	uint16_t i = 0;
	for(i = 0;(i < BuffNum)&&(i < USART0_TXBUFF_COUNT_MAX);i++)
	{
		Usart0TxBuff[i] = TxBuff[i];
	}
	
	dma_transfer_number_config(DMA1, DMA_CH7, BuffNum);           


	dma_channel_enable(DMA1, DMA_CH7);							

