YP-LXL/my-project/src/driver/gd32f4x.c
}

void gd32f4x_pc_communicate_txbuff(uint8_t *TxBuff,uint16_t BuffNum)
{
	uint16_t i = 0;
	for(i = 0;(i < BuffNum)&&(i < USART2_TXBUFF_COUNT_MAX);i++)
	{
		Usart2TxBuff[i] = TxBuff[i];
	}
	
	dma_transfer_number_config(DMA0, DMA_CH1, BuffNum);          


	dma_channel_enable(DMA0, DMA_CH1);							

}


/* ************************************************************************** */
fun_usart_recive_callback uart0_receive_callback = NULL;
uint8_t gd32f4x_usart0_set_receive_callback(fun_usart_recive_callback receive_callback)
{
    if (NULL == receive_callback) {
        return 1;
    }

    uart0_receive_callback = receive_callback;
    return 0;
}
/**
 * @函数名称: USART0_IRQHandler()
 * @功能描述: 串口0中断函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void USART0_IRQHandler(void)
{
	/* BaseType_t RS485ARx_L;*/
    uint32_t data_len = 0;
    uint32_t ulReturn;   
	ulReturn = taskENTER_CRITICAL_FROM_ISR();
    /* 如果是空闲中断 */
	if (usart_interrupt_flag_get(USART0, USART_INT_FLAG_IDLE) != RESET) {
		usart_interrupt_flag_clear(USART0,USART_INT_FLAG_IDLE);	
		
		(void)usart_data_receive(USART0);
		
		dma_channel_disable(DMA1, DMA_CH5);						
		dma_flag_clear(DMA1, DMA_CH5, DMA_INTF_FTFIF);		

		data_len = USART0_RXBUFF_COUNT_MAX-dma_transfer_number_get(DMA1, DMA_CH5);
        
	 	//gd32f4x_dcdc_communicate_rxbuffnumber(USART0_RXBUFF_COUNT_MAX-dma_transfer_number_get(DMA1, DMA_CH5));
        // printf(" USART0_IRQHandler read_len= %ld \r\n", data_len);
        // for (uint16_t i = 0; i < data_len; i++) {
        //     printf(" %x \r\n", Usart0RxBuff[i]);
        // }
        if (uart0_receive_callback) {
            /*回调进入组包函数*/
            uart0_receive_callback(Usart0RxBuff, data_len);
        }
        dma_interrupt_flag_clear(DMA1,DMA_CH5,DMA_INT_FLAG_FTF);
		dma_channel_enable(DMA1, DMA_CH5); 
		      
	}

    /* 如果是发送完成中断 */
	if (usart_interrupt_flag_get(USART0, USART_INT_FLAG_RBNE) != RESET) {
        DRIVER_LOG(" USART0 USART_INT_FLAG_RBNE IRQ \r\n");
		usart_interrupt_flag_clear(USART0,USART_INT_FLAG_RBNE);	
	} 	
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}

/* ************************************************************************** */
fun_usart_recive_callback usart2_receive_callback = NULL;
uint8_t gd32f4x_usart2_set_receive_callback(fun_usart_recive_callback receive_callback)
{
    if (NULL == receive_callback) {
        return 1;
    }

    usart2_receive_callback = receive_callback;
    return 0;
}
/**
 * @函数名称: USART2_IRQHandler()
 * @功能描述: 串口2中断函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
/*static u16 data[10] = {0};*/
void USART2_IRQHandler(void)
{
	uint32_t data_len = 0;
	uint32_t ulReturn;
    // DRIVER_LOG(" RS485 RX IRQ \r\n");
	ulReturn = taskENTER_CRITICAL_FROM_ISR();
	if(usart_interrupt_flag_get(USART2, USART_INT_FLAG_IDLE) != RESET)
	{
		usart_interrupt_flag_clear(USART2,USART_INT_FLAG_IDLE);	
		(void)usart_data_receive(USART2);
		dma_channel_disable(DMA0, DMA_CH1);					
		dma_flag_clear(DMA0, DMA_CH1, DMA_INTF_FTFIF);		

        data_len = (USART2_RXBUFF_COUNT_MAX-dma_transfer_number_get(DMA0, DMA_CH1));
        if (usart2_receive_callback) {
            /*回调进入组包函数*/
            usart2_receive_callback(Usart2RxBuff, data_len);
        }
        dma_interrupt_flag_clear(DMA0,DMA_CH1,DMA_INT_FLAG_FTF);
		dma_channel_enable(DMA0, DMA_CH1); 
	}
	
	if(usart_interrupt_flag_get(USART2, USART_INT_IDLE) != RESET)
	{	
        DRIVER_LOG(" RS485 RX IRQ USART_INT_IDLE \r\n");
		usart_interrupt_flag_clear(USART2,USART_INT_IDLE);	
	} 	
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}
/* 回调函数处理 */
fun_usart_recive_callback usart2_data_process(uint8_t* data, uint32_t length) {
    int num = 0;
    for(uint8_t i = 0;i < length;i++) {
        num += (data[i]-'0')*pow(10,length-1-i);     
    }
    gd32f4x_timer2_led_j49_6_set_duty(num);
    printf("duty = %d\r\n", num); 

}










/* ************************************************************************** */
fun_usart_recive_callback uart3_receive_callback = NULL;
uint8_t gd32f4x_uart3_set_receive_callback(fun_usart_recive_callback receive_callback)
{
    if (NULL == receive_callback) {
        return 1;
    }

    uart3_receive_callback = receive_callback;
    return 0;
}
/**
 * @函数名称: UART3_IRQHandler()
 * @功能描述: 串口3中断函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
//static u16 data[10] = {0};
void UART3_IRQHandler(void)
{
    uint32_t data_len = 0;
    uint32_t ulReturn;
	ulReturn = taskENTER_CRITICAL_FROM_ISR();

	if(usart_interrupt_flag_get(UART3, USART_INT_FLAG_IDLE) != RESET)
	{
		usart_interrupt_flag_clear(UART3,USART_INT_FLAG_IDLE);	
		(void)usart_data_receive(UART3);

		dma_channel_disable(DMA0, DMA_CH2);					
		dma_flag_clear(DMA0, DMA_CH2, DMA_INTF_FTFIF);			
        
        data_len = (UART3_RXBUFF_COUNT_MAX-dma_transfer_number_get(DMA0, DMA_CH2));
        if (uart3_receive_callback) {
            uart3_receive_callback(Uart3RxBuff, data_len);
        }
        /*  ATcmd_server();
            printf("cmd run over over over\r\n");
		    MCU_Drive_External_RS485RxBuffNum(USART2_RXBUFF_COUNT_MAX-dma_transfer_number_get(DMA0, DMA_CH2));获取接收到的字节数 485任务才会用到*/
		dma_interrupt_flag_clear(DMA0,DMA_CH2,DMA_INT_FLAG_FTF);
		dma_channel_enable(DMA0, DMA_CH2); 

	}
	
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}

/**
 * @函数名称: usart0_send_msg()
 * @功能描述: usart0设备发送消息功能
 * @输入: 数据：data 长度：len
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t usart0_send_msg(uint8_t* data, uint16_t len)
{
    /* 先做长度判断以提前返回错误 */
    if (len > USART0_TXBUFF_COUNT_MAX || len == 0) {
        /* 长度错误 */
        return 1; // 失败
    }
    uint16_t count = 0;
    for (count = 0; count < len; count++) {
        Usart0TxBuff[count] = data[count];
    }

    dma_transfer_number_config(DMA1, DMA_CH7, len);
    dma_channel_enable(DMA1, DMA_CH7);

    return 0; // 成功
}

/**
 * @函数名称: usart2_send_msg()
 * @功能描述: usart2设备发送消息功能
 * @输入: 数据：data 长度：len
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t usart2_send_msg(uint8_t* data, uint16_t len)
{
    /* 先做长度判断以提前返回错误 */
    if (len > USART2_TXBUFF_COUNT_MAX || len == 0) {
        /* 长度错误 */
        return 1; // 失败
    }
    uint16_t count = 0;
    for (count = 0; count < len; count++) {
        Usart2TxBuff[count] = data[count];
    }

    dma_transfer_number_config(DMA0, DMA_CH3, len);
    dma_channel_enable(DMA0, DMA_CH3);

    return 0; // 成功
}


/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_dma_init()
 * @功能描述: DMA初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_dma_init(void)
{
	dma_single_data_parameter_struct dma_single_data_parameter;
	
	rcu_periph_clock_enable(RCU_DMA0);
	rcu_periph_clock_enable(RCU_DMA1);

	
	/* 串口0 DMA codes------------------------------------------------------------------*/
	/*串口0 数据发送使用DMA1的通道7，外设4    数据接收使用DAM1的通道2，外设4*/
	dma_deinit(DMA1, DMA_CH5);/*复位DMA1的通道5,DMA1的通道2用于串口0的接收 RX*/
	dma_deinit(DMA1, DMA_CH7);/*复位DMA1的通道7,DMA1的通道7用于串口0的发送 TX*/
	
	usart_interrupt_flag_clear(USART0,USART_INT_FLAG_TC);										/*清除串口0的发送中断完成标志位*/
	
	/*串口0 数据发送使用DAM1的通道7，外设4*/
	dma_single_data_parameter.periph_addr 					    = (uint32_t)(&USART_DATA(USART0));			
	dma_single_data_parameter.periph_inc 						= DMA_PERIPH_INCREASE_DISABLE;		
	dma_single_data_parameter.memory0_addr 					    = (uint32_t)&Usart0TxBuff[0];				
	dma_single_data_parameter.memory_inc 						= DMA_MEMORY_INCREASE_ENABLE;			
	dma_single_data_parameter.periph_memory_width 	            = DMA_PERIPH_WIDTH_8BIT;			
    dma_single_data_parameter.direction 						= DMA_MEMORY_TO_PERIPH;					
	dma_single_data_parameter.number 							= USART0_TXBUFF_COUNT_MAX;			
	dma_single_data_parameter.priority 							= DMA_PRIORITY_ULTRA_HIGH;					
	dma_single_data_mode_init(DMA1, DMA_CH7, &dma_single_data_parameter);

	dma_channel_subperipheral_select(DMA1, DMA_CH7, DMA_SUBPERI4);	

