YP-LXL/my-project/src/driver/gd32f4x.c
    dma_interrupt_enable(DMA1,DMA_CH7,DMA_CHXCTL_FTFIE);

    nvic_irq_enable(DMA1_Channel7_IRQn, 2, 0);	

    // dma_circulation_enable(DMA1, DMA_CH7);	
													
	/*串口0 数据接收使用DAM1的通道5，外设4*/
	dma_single_data_parameter.periph_addr 					    = (uint32_t)(&USART_DATA(USART0));			
	dma_single_data_parameter.periph_inc 						= DMA_PERIPH_INCREASE_DISABLE;		
	dma_single_data_parameter.memory0_addr 					    = (uint32_t)&Usart0RxBuff[0];					
	dma_single_data_parameter.memory_inc 						= DMA_MEMORY_INCREASE_ENABLE;			
	dma_single_data_parameter.periph_memory_width 	            = DMA_PERIPH_WIDTH_8BIT;					
    dma_single_data_parameter.direction 						= DMA_PERIPH_TO_MEMORY;						
	dma_single_data_parameter.number 							= USART0_RXBUFF_COUNT_MAX;				
	dma_single_data_parameter.priority 							= DMA_PRIORITY_HIGH;					   
	dma_single_data_mode_init(DMA1, DMA_CH5, &dma_single_data_parameter);
	
	dma_circulation_enable(DMA1, DMA_CH5);																						

	dma_channel_subperipheral_select(DMA1, DMA_CH5, DMA_SUBPERI4);										
	
	dma_transfer_number_config(DMA1, DMA_CH5, USART0_RXBUFF_COUNT_MAX);     					
	
	// dma_circulation_disable(DMA1, DMA_CH5);		
	
	

	/* 串口2 DMA codes------------------------------------------------------------------*/
	dma_deinit(DMA0, DMA_CH1);
	dma_deinit(DMA0, DMA_CH3);
	
	/*串口2 TX 数据发送使用DMA0的通道3，外设4 数据接收使用DAM0的通道1，外设4*/
	usart_interrupt_flag_clear(USART2,USART_INT_FLAG_TC);										
	
	dma_single_data_parameter.periph_addr 					    = (uint32_t)(&USART_DATA(USART2));		
	dma_single_data_parameter.periph_inc 						= DMA_PERIPH_INCREASE_DISABLE;		
	dma_single_data_parameter.memory0_addr 					    = (uint32_t)&Usart2TxBuff[0];					
	dma_single_data_parameter.memory_inc 						= DMA_MEMORY_INCREASE_ENABLE;			
	dma_single_data_parameter.periph_memory_width 	            = DMA_PERIPH_WIDTH_8BIT;				
    dma_single_data_parameter.direction 						= DMA_MEMORY_TO_PERIPH;					
	dma_single_data_parameter.number 							= USART2_TXBUFF_COUNT_MAX;				
	dma_single_data_parameter.priority 							= DMA_PRIORITY_MEDIUM;						
	dma_single_data_mode_init(DMA0, DMA_CH3, &dma_single_data_parameter);

	dma_channel_subperipheral_select(DMA0, DMA_CH3, DMA_SUBPERI4);										
	dma_interrupt_enable(DMA0,DMA_CH3,DMA_CHXCTL_FTFIE);															
	nvic_irq_enable(DMA0_Channel3_IRQn, 1, 0);																		
	
	/*串口2 RX 数据接收使用DAM0的通道1，外设4*/
	dma_single_data_parameter.periph_addr 					    = (uint32_t)(&USART_DATA(USART2));		
	dma_single_data_parameter.periph_inc 						= DMA_PERIPH_INCREASE_DISABLE;		
	dma_single_data_parameter.memory0_addr 					    = (uint32_t)&Usart2RxBuff[0];				
	dma_single_data_parameter.memory_inc 						= DMA_MEMORY_INCREASE_ENABLE;			
	dma_single_data_parameter.periph_memory_width 	            = DMA_PERIPH_WIDTH_8BIT;				
    dma_single_data_parameter.direction 						= DMA_PERIPH_TO_MEMORY;					
	dma_single_data_parameter.number 							= USART2_RXBUFF_COUNT_MAX;				
	dma_single_data_parameter.priority 							= DMA_PRIORITY_HIGH;					
	dma_single_data_mode_init(DMA0, DMA_CH1, &dma_single_data_parameter);
	
	dma_circulation_enable(DMA0, DMA_CH1);																					

	dma_channel_subperipheral_select(DMA0, DMA_CH1, DMA_SUBPERI4);										
	
	dma_transfer_number_config(DMA0, DMA_CH1, USART2_RXBUFF_COUNT_MAX);     					
	
	dma_channel_enable(DMA0, DMA_CH1);																								

    /* 串口3 DMA codes------------------------------------------------------------------*/
    /*串口3 RX 数据接收使用DAM0的通道2，外设4*/
	dma_single_data_parameter.periph_addr 					    = (uint32_t)(&USART_DATA(UART3));			
	dma_single_data_parameter.periph_inc 						= DMA_PERIPH_INCREASE_DISABLE;		
	dma_single_data_parameter.memory0_addr 					    = (uint32_t)&Uart3RxBuff[0];				
	dma_single_data_parameter.memory_inc 						= DMA_MEMORY_INCREASE_ENABLE;		
	dma_single_data_parameter.periph_memory_width 	            = DMA_PERIPH_WIDTH_8BIT;					
    dma_single_data_parameter.direction 						= DMA_PERIPH_TO_MEMORY;						
	dma_single_data_parameter.number 							= UART3_RXBUFF_COUNT_MAX;				
	dma_single_data_parameter.priority 							= DMA_PRIORITY_HIGH;					  
	dma_single_data_mode_init(DMA0, DMA_CH2, &dma_single_data_parameter);
	
	dma_circulation_enable(DMA0, DMA_CH2);																						

	dma_channel_subperipheral_select(DMA0, DMA_CH2, DMA_SUBPERI4);									
	
	dma_transfer_number_config(DMA0, DMA_CH2, UART3_RXBUFF_COUNT_MAX);     				
	
	dma_channel_enable(DMA0, DMA_CH2);		

}




/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_dma1ch0_init()
 * @功能描述: 针对ADC通道的DMA初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_dma1ch0_init(void)
{
    rcu_periph_clock_enable(RCU_DMA1);
	dma_single_data_parameter_struct dma_single_data_parameter;
	dma_deinit(DMA1,DMA_CH0);
	
	dma_single_data_parameter.periph_addr = (uint32_t)(&ADC_RDATA(ADC0));	
	dma_single_data_parameter.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_single_data_parameter.memory0_addr = (uint32_t)(&uiDMAData); 
	dma_single_data_parameter.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_single_data_parameter.periph_memory_width = DMA_PERIPH_WIDTH_32BIT;
	dma_single_data_parameter.direction = DMA_PERIPH_TO_MEMORY; 
	dma_single_data_parameter.number = (uint32_t)DMA1_CH0_BUFF_MAX;
	dma_single_data_parameter.circular_mode = DMA_CIRCULAR_MODE_ENABLE;
	dma_single_data_parameter.priority = DMA_PRIORITY_HIGH;
	dma_single_data_mode_init(DMA1,DMA_CH0,&dma_single_data_parameter);
	
	dma_channel_subperipheral_select(DMA1, DMA_CH0,DMA_SUBPERI0);

	nvic_priority_group_set(NVIC_PRIGROUP_PRE4_SUB0);
	nvic_irq_enable(DMA1_Channel0_IRQn, 1, 1);
	
	dma_circulation_enable(DMA1, DMA_CH0);
	dma_interrupt_enable(DMA1, DMA_CH0,DMA_CHXCTL_FTFIE);

	 
	dma_channel_enable(DMA1, DMA_CH0);
}

/* ************************************************************************** */
/**
 * @函数名称: DMA0_Channel3_IRQHandler()
 * @功能描述:  MCU的DMA0的通道3中断函数   USART2  对外采集器、上位机等
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void DMA0_Channel3_IRQHandler(void)
{
	if(dma_interrupt_flag_get(DMA0, DMA_CH3, DMA_INT_FLAG_FTF))
	{
		dma_channel_disable(DMA0, DMA_CH3);								
		
		dma_interrupt_flag_clear(DMA0, DMA_CH3, DMA_INT_FLAG_FTF);     
	}
}

/* ************************************************************************** */
/**
 * @函数名称: DMA1_Channel7_IRQHandler()
 * @功能描述: MCU的DMA4的通道7中断函数   USART0  对内底板
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */  
void DMA1_Channel7_IRQHandler(void)
{
	if(dma_flag_get(DMA1, DMA_CH7, DMA_INT_FLAG_FTF) == SET)
	{
		dma_channel_disable(DMA1, DMA_CH7);								
		dma_flag_clear(DMA1, DMA_CH7, DMA_INT_FLAG_FTF);    
	}
}

/* ************************************************************************** */
/**
 * @函数名称: DMA1_Channel0_IRQHandler()
 * @功能描述: MCU的DMA1的通道0中断函数  ADC中断在10S中是用于切换片选开关的
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */  
void DMA1_Channel0_IRQHandler(void)
{
    // uint8_t i = 0;
	if(dma_flag_get(DMA1, DMA_CH0, DMA_INT_FLAG_FTF) == SET)
	{
        // printf("adc[%d]=%ld adc[%d]=%ld adc[%d]=%ld adc[%d]=%ld adc[%d]=%ld \r\n",0,uiDMAData[0],1,uiDMAData[1],2,uiDMAData[2],3,uiDMAData[3],4,uiDMAData[4]);
        // for(int i=0;i<5;i++){
        //     printf("adc[%d] = %ld\r\n",i,uiDMAData[i]);
        // }
		dma_flag_clear(DMA1, DMA_CH0, DMA_INT_FLAG_FTF);     
		
