YP-LXL/my-project/src/driver/gd32f4x.c
	}
} 


/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_adc_init()
 * @功能描述: ADC初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_adc_init(void)
{
    rcu_periph_clock_enable(ADC3_GPIO_CLOCK);
    rcu_periph_clock_enable(ADC4_GPIO_CLOCK);
    rcu_periph_clock_enable(ADC9_GPIO_CLOCK);
    rcu_periph_clock_enable(ADC11_GPIO_CLOCK);
    rcu_periph_clock_enable(ADC12_GPIO_CLOCK);
	adc_deinit();
	/*ADC的GPIO管脚复用功能配置*/
/*	gpio_mode_set(ADC1_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC1_PIN);
	gpio_mode_set(ADC2_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC2_PIN);*/
    /*J4的SENSE+上，采集电池放电时电流值，正向参考，mV值*/
	gpio_mode_set(ADC3_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC3_PIN);
    /*CAN，485通讯芯片供电电源的电压采集，V=Vadc*（338.2/8.2）*/
	gpio_mode_set(ADC4_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC4_PIN);
/*	gpio_mode_set(ADC5_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC5_PIN);
	gpio_mode_set(ADC6_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC6_PIN);
	gpio_mode_set(ADC7_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC7_PIN);
	gpio_mode_set(ADC8_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC8_PIN);*/
    /*NTC4*/
	gpio_mode_set(ADC9_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC9_PIN);
/*	gpio_mode_set(ADC10_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC10_PIN);*/
    /*BOARD_TEMP*/
	gpio_mode_set(ADC11_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC11_PIN);
    /*输入，ADC12_IN12，采集电池总电压（BAT+)*/
	gpio_mode_set(ADC12_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC12_PIN);
/*	gpio_mode_set(ADC13_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC13_PIN);
	gpio_mode_set(ADC14_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC14_PIN);
	gpio_mode_set(ADC15_GPIO,GPIO_MODE_ANALOG,GPIO_PUPD_NONE,ADC15_PIN);*/


	rcu_periph_clock_enable(RCU_ADC0);	

	adc_clock_config(ADC_ADCCK_PCLK2_DIV8);
	
	adc_sync_mode_config(ADC_SYNC_MODE_INDEPENDENT);
	adc_special_function_config(ADC0,ADC_SCAN_MODE,ENABLE);
	adc_special_function_config(ADC0,ADC_CONTINUOUS_MODE,ENABLE);
	
	adc_data_alignment_config(ADC0,ADC_DATAALIGN_RIGHT);
	adc_channel_length_config(ADC0,ADC_REGULAR_CHANNEL,ADC0_CHANNEL_NUMBER);
	adc_resolution_config(ADC0,ADC_RESOLUTION_12B);
	adc_external_trigger_config(ADC0,ADC_REGULAR_CHANNEL,EXTERNAL_TRIGGER_DISABLE);
	
/*	adc_oversample_mode_disable(ADC0);//禁能ADC过采样
	adc_software_trigger_enable(ADC1,ADC_ROUTINE_CHANNEL);
	adc_end_of_conversion_config(ADC0,ADC_EOC_SET_SEQUENCE);
	adc_routine_channel_config(ADC1,0,ADC_CHANNEL_9,ADC_SAMPLETIME_56);
    adc_routine_channel_config(ADC1,1,ADC_CHANNEL_8,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC1,2,ADC_CHANNEL_15,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC1,3,ADC_CHANNEL_14,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC1,4,ADC_CHANNEL_7,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC1,5,ADC_CHANNEL_6,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC1,6,ADC_CHANNEL_5,ADC_SAMPLETIME_56);*/
    adc_regular_channel_config(ADC0,0,ADC_CHANNEL_3,ADC_SAMPLETIME_56);
	adc_regular_channel_config(ADC0,1,ADC_CHANNEL_4,ADC_SAMPLETIME_56);
	adc_regular_channel_config(ADC0,2,ADC_CHANNEL_9,ADC_SAMPLETIME_56);
/*  adc_routine_channel_config(ADC1,10,ADC_CHANNEL_1,ADC_SAMPLETIME_56);          
	adc_routine_channel_config(ADC1,11,ADC_CHANNEL_13,ADC_SAMPLETIME_56);
	adc_routine_channel_config(ADC0,0,ADC_CHANNEL_10,ADC_SAMPLETIME_56);*/
    adc_regular_channel_config(ADC0,3,ADC_CHANNEL_11,ADC_SAMPLETIME_56);                                
    adc_regular_channel_config(ADC0,4,ADC_CHANNEL_12,ADC_SAMPLETIME_56);   
    /************* */
	gd32f4x_dma1ch0_init();	
	
	adc_dma_mode_enable(ADC0);
	adc_dma_request_after_last_enable(ADC0);
	
	adc_enable(ADC0);
	gd32f4x_delay_ms(1);
	adc_calibration_enable(ADC0);
	adc_software_trigger_enable(ADC0,ADC_REGULAR_CHANNEL);
}

/* ************************************************************************** */
/**
 * @函数名称: void gd32f4x_timer2_init(void)
 * @功能描述: TIMER2初始化 1个LED初始化 
 * @输入: usr_hz
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer2_init(uint32_t usr_hz)
{

	rcu_periph_clock_enable(LED_J49_6_RCU_CLOCK);

    gpio_mode_set(LED_J49_6_GPIO, GPIO_MODE_AF, GPIO_PUPD_NONE, LED_J49_6_PIN);
	gpio_af_set(LED_J49_6_GPIO, LED_J49_6_AF, LED_J49_6_PIN);
    gpio_output_options_set(LED_J49_6_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, LED_J49_6_PIN);

    rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL4);   

	timer_parameter_struct timer_initpara;

	rcu_periph_clock_enable(RCU_TIMER2);
	rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL2);
	timer_struct_para_init(&timer_initpara);
	timer_deinit(TIMER2);
	
	timer_initpara.prescaler            = 100-1;
	timer_initpara.alignedmode          = TIMER_COUNTER_EDGE; 
	timer_initpara.counterdirection     = TIMER_COUNTER_UP; 
	timer_initpara.period               = 1000-1;
	timer_initpara.clockdivision        = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter    = 0; 
	timer_init(TIMER2,&timer_initpara);

    timer_oc_parameter_struct timer_ocintpara_d;
    timer_ocintpara_d.ocpolarity = TIMER_OC_POLARITY_HIGH;
    timer_ocintpara_d.outputstate = TIMER_CCX_ENABLE;
    timer_ocintpara_d.ocnpolarity = TIMER_OCN_POLARITY_HIGH;
    timer_ocintpara_d.outputnstate = TIMER_CCXN_ENABLE;
    timer_ocintpara_d.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
    timer_ocintpara_d.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    timer_channel_output_config(TIMER2, TIMER_CH_3, &timer_ocintpara_d);
    timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_PWM0);
    timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_3, (20 * (SystemCoreClock / 2 / usr_hz) / 100));
    timer_channel_output_shadow_config(TIMER2, TIMER_CH_3, TIMER_OC_SHADOW_DISABLE);

    /* 激活输出通道 */
    timer_channel_output_state_config(TIMER2, TIMER_CH_3, TIMER_CCX_ENABLE);
    timer_channel_complementary_output_state_config(TIMER2, TIMER_CH_3, TIMER_CCXN_DISABLE);
    timer_channel_output_polarity_config(TIMER2, TIMER_CH_3, TIMER_OC_POLARITY_HIGH);

    /* 启用TIMER2主输出 */
    timer_primary_output_config(TIMER2, ENABLE);

    /* 开启TIMER2计数 */
    timer_enable(TIMER2);
    gd32f4x_timer2_led_j49_6_set_duty(0);
}

/**
 * @函数名称: gd32f4x_timer2_channel_set_duty()
 * @功能描述: 呼吸灯初始化
 * @输入: LED_J49_6_CHANNEL
 *        占空比：0-100
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer2_channel_set_duty(uint16_t channel, uint16_t duty)
{
    uint32_t period = TIMER_CAR(TIMER2);
    uint32_t pulse = (duty * period) / 100;
    /* 更新占空比 */
    timer_channel_output_pulse_value_config(TIMER2, channel, pulse);
}


/**
 * @函数名称: gd32f4x_timer2_led_j49_6_set_duty()
 * @功能描述: LED(J49-6)占空比设置
 * @输入: duty 占空比：0-100
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer2_led_j49_6_set_duty(uint8_t duty)
{
    gd32f4x_timer2_channel_set_duty(LED_J49_6_CHANNEL, duty);
}


 
/* ************************************************************************** */
/**
 * @函数名称: void gd32f4x_timer2_init(void)
 * @功能描述: TIMER4初始化 100mS定时中断回调函数	 
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer4_init(void)
{
	timer_parameter_struct timer_initpara;
	
	rcu_periph_clock_enable(RCU_TIMER4);
	rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL2);
/*	timer_struct_para_init(&timer_initpara);将定时器结构体内参数配置成默认参数*/
	timer_deinit(TIMER4);//复位外设TIMER4
	
	timer_initpara.prescaler = 1000-1;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE; 
	timer_initpara.counterdirection  = TIMER_COUNTER_UP; 
	timer_initpara.period = 10000-1; 
	timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0; 
	timer_init(TIMER4,&timer_initpara);
	
