YP-LXL/my-project/src/driver/gd32f4x.c
	timer_auto_reload_shadow_enable(TIMER4);
	
	timer_interrupt_enable(TIMER4,TIMER_INT_UP);
	
	
	nvic_irq_enable(TIMER4_IRQn, 0, 5);
	
	timer_enable(TIMER4);
} 

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_timer0_init(uint16_t Prescaler, uint32_t Period, uint32_t Duty)
 * @功能描述: TIMER0初始化 蜂鸣器
 * @输入: Prescaler 预分频值 Period 计数值 Duty 占空比
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer0_init(uint16_t Prescaler, uint32_t Period, uint32_t BUZZER_Duty, uint32_t LED_Duty)
{
	rcu_periph_clock_enable(BUZZER_RCU_CLOCK);
	rcu_periph_clock_enable(LED_J49_7_RCU_CLOCK);

	/* LED(J49-7)，电量指示LED */
	gpio_mode_set(LED_J49_7_GPIO,GPIO_MODE_AF,GPIO_PUPD_NONE,LED_J49_7_PIN);
	gpio_output_options_set(LED_J49_7_GPIO,GPIO_OTYPE_PP,GPIO_OSPEED_50MHZ,LED_J49_7_PIN);
	gpio_af_set(LED_J49_7_GPIO, LED_J49_7_AF, LED_J49_7_PIN);
    gpio_bit_reset(LED_J49_7_GPIO,LED_J49_7_PIN);

    /* 蜂鸣器 
	 gpio_mode_set(BUZZER_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, BUZZER_PIN);
     gpio_output_options_set(BUZZER_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, BUZZER_PIN);
     gpio_af_set(BUZZER_PORT, BUZZER_AF, BUZZER_PIN);
     gpio_bit_reset(BUZZER_PORT,BUZZER_PIN);*/


	timer_parameter_struct timer_initpara;
	timer_oc_parameter_struct timer_ocinitstructure;
	
	rcu_periph_clock_enable(RCU_TIMER0);									
	rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL2);	
	timer_struct_para_init(&timer_initpara);							
	timer_deinit(TIMER0);																
	
	timer_initpara.prescaler = Prescaler;										
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE; 		
	timer_initpara.counterdirection  = TIMER_COUNTER_UP; 	    
	timer_initpara.period = (uint32_t)Period; 									
	timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0; 							
	timer_init(TIMER0,&timer_initpara);
	
	timer_auto_reload_shadow_enable(TIMER0);							
	
	/* -----------------------------------------------------------------------
    TIMER0 configuration to:
    generate 3 complementary PWM signals with 3 different duty cycles:
    TIMER0CLK is fixed to systemcoreclock, the TIMER0 prescaler is equal to 5400 so the 
    TIMER0 counter clock used is 20KHz.
    the three duty cycles are computed as the following description: 
    the channel 0 duty cycle is set to 25% so channel 1N is set to 75%.
    the channel 1 duty cycle is set to 50% so channel 2N is set to 50%.
    the channel 2 duty cycle is set to 75% so channel 3N is set to 25%.
  ----------------------------------------------------------------------- */
	timer_ocinitstructure.outputstate           = TIMER_CCX_ENABLE;					
	timer_ocinitstructure.outputnstate 			= TIMER_CCXN_ENABLE;			
	timer_ocinitstructure.ocpolarity   			= TIMER_OC_POLARITY_HIGH;		
	timer_ocinitstructure.ocnpolarity  			= TIMER_OCN_POLARITY_HIGH;	
	timer_ocinitstructure.ocidlestate  			= TIMER_OC_IDLE_STATE_LOW;	
	timer_ocinitstructure.ocnidlestate 			= TIMER_OCN_IDLE_STATE_LOW;	

	timer_channel_output_config(TIMER0,TIMER_CH_0,&timer_ocinitstructure);
	timer_channel_output_config(TIMER0,TIMER_CH_1,&timer_ocinitstructure);
	/*LED1*/
    timer_channel_output_pulse_value_config(TIMER0,TIMER_CH_0,LED_Duty);
    timer_channel_output_mode_config(TIMER0,TIMER_CH_0,TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER0,TIMER_CH_0,TIMER_OC_SHADOW_ENABLE);
	
	/*蜂鸣器*/
	timer_channel_output_pulse_value_config(TIMER0,TIMER_CH_1,BUZZER_Duty);
    timer_channel_output_mode_config(TIMER0,TIMER_CH_1,TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER0,TIMER_CH_1,TIMER_OC_SHADOW_ENABLE);

    timer_primary_output_config(TIMER0,ENABLE);

	timer_enable(TIMER0);
}

/**
 * @函数名称: gd32f4x_time0_channel_set_duty()
 * @功能描述: 呼吸灯初始化
 * @输入: 通道：LED_J49_7_CHANNEL
 *        占空比：0-100
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer0_channel_set_duty(uint16_t channel, uint16_t duty)
{
    uint32_t period = TIMER_CAR(TIMER0);
    uint32_t pulse = (duty * period) / 100;
    /* 更新占空比 */
    timer_channel_output_pulse_value_config(TIMER0, channel, pulse);
}


/**
 * @函数名称: gd32f4x_time0_led_j49_7_set_duty()
 * @功能描述: LED_J49_7占空比设置
 * @输入: duty 占空比：0-100
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer0_led_j49_7_set_duty(uint8_t duty)
{
    gd32f4x_timer0_channel_set_duty(LED_J49_7_CHANNEL, duty);
}


/**
 * @函数名称: gd32f4x_timer0ch1_set_hz()
 * @功能描述: 蜂鸣器频率更改
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer0ch1_set_hz(uint32_t new_hz)
{
    uint32_t old_arr = TIMER_CAR(TIMER0);
    uint32_t old_ccr = TIMER_CH1CV(TIMER0);
    /* 计算更改前的占空比 */
    float duty_cycle = (float)old_ccr / (old_arr + 1);
    uint32_t new_arr = (SystemCoreClock / 2 / new_hz) - 1;
    uint32_t new_ccr = (uint32_t)(duty_cycle * (new_arr + 1));
    /* 更新ARR来更新频率 */
    TIMER_CAR(TIMER0) = new_arr;
    /* 更新ARR会带来占空比的改变，更新crr来保持原有的占空比 */
    TIMER_CH1CV(TIMER0) = new_ccr;
}

/**
 * @函数名称: gd32f4x_timer0ch1_set_pwm_duty()
 * @功能描述: 蜂鸣器占空比更改
 * @输入: duty 占空比
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer0ch1_set_pwm_duty(uint8_t duty)
{
    uint32_t period = TIMER_CAR(TIMER0);
    uint32_t pulse = ((100 - duty) * period) / 100;
    /* 更新占空比 */
    timer_channel_output_pulse_value_config(TIMER0, BUZZER_CHANNEL, pulse);
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_timer8_init(uint16_t Prescaler, uint32_t Period, uint32_t Duty)
 * @功能描述: TIMER8初始化 风扇
 * @输入: Prescaler 预分频值 Period 计数值 Duty 占空比
 * @输出: 无
 * @返回值: 无
 */ 
void gd32f4x_timer8_init(uint16_t Prescaler, uint32_t Period, uint32_t Duty)
{
	rcu_periph_clock_enable(FAN_RCU_CLOCK);		
	gpio_mode_set(FAN_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, FAN_PIN);
    gpio_output_options_set(FAN_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, FAN_PIN);
    gpio_af_set(FAN_PORT, FAN_AF, FAN_PIN);
	
	timer_parameter_struct timer_initpara;
	timer_oc_parameter_struct timer_ocinitstructure;
	
	rcu_periph_clock_enable(RCU_TIMER8);									
	rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL2);	
	timer_struct_para_init(&timer_initpara);							
	timer_deinit(TIMER8);																	
	
