YP-LXL/my-project/src/driver/gd32f4x.c
	timer_initpara.prescaler = Prescaler;								
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE; 			
	timer_initpara.counterdirection  = TIMER_COUNTER_UP; 	
	timer_initpara.period = (uint32_t)Period; 									
	timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0; 								
	timer_init(TIMER8,&timer_initpara);
	
	timer_auto_reload_shadow_enable(TIMER8);						
	
	/* -----------------------------------------------------------------------
    TIMER0 configuration to:
    generate 3 complementary PWM signals with 3 different duty cycles:
    TIMER0CLK is fixed to systemcoreclock, the TIMER0 prescaler is equal to 5400 so the 
    TIMER0 counter clock used is 20KHz.
    the three duty cycles are computed as the following description: 
    the channel 0 duty cycle is set to 25% so channel 1N is set to 75%.
    the channel 1 duty cycle is set to 50% so channel 2N is set to 50%.
    the channel 2 duty cycle is set to 75% so channel 3N is set to 25%.
  ----------------------------------------------------------------------- */
	timer_ocinitstructure.outputstate           = TIMER_CCX_ENABLE;					
	timer_ocinitstructure.outputnstate 			= TIMER_CCXN_ENABLE;				
	timer_ocinitstructure.ocpolarity   			= TIMER_OC_POLARITY_HIGH;		
	timer_ocinitstructure.ocnpolarity  			= TIMER_OCN_POLARITY_HIGH;	
	timer_ocinitstructure.ocidlestate  			= TIMER_OC_IDLE_STATE_LOW;	
	timer_ocinitstructure.ocnidlestate 			= TIMER_OCN_IDLE_STATE_LOW;	

	timer_channel_output_config(TIMER8,TIMER_CH_0,&timer_ocinitstructure);

    timer_channel_output_pulse_value_config(TIMER8,TIMER_CH_0,Duty);
    timer_channel_output_mode_config(TIMER8,TIMER_CH_0,TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER8,TIMER_CH_0,TIMER_OC_SHADOW_ENABLE);
	
	timer_enable(TIMER8);

}

/**
 * @函数名称: gd32f4x_timer8ch0_set_hz()
 * @功能描述: 风扇频率更改
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer8ch0_set_hz(uint32_t new_hz)
{
    uint32_t old_arr = TIMER_CAR(TIMER8);
    uint32_t old_ccr = TIMER_CH0CV(TIMER8);
    /* 计算更改前的占空比 */
    float duty_cycle = (float)old_ccr / (old_arr + 1);
    uint32_t new_arr = (SystemCoreClock / 2 / new_hz) - 1;
    uint32_t new_ccr = (uint32_t)(duty_cycle * (new_arr + 1));
    /* 更新ARR来更新频率 */
    TIMER_CAR(TIMER8) = new_arr;
    /* 更新ARR会带来占空比的改变，更新crr来保持原有的占空比 */
    TIMER_CH0CV(TIMER8) = new_ccr;
}

/**
 * @函数名称: gd32f4x_timer8ch0_set_pwm_duty()
 * @功能描述: 风扇占空比更改
 * @输入: duty 占空比
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer8ch0_set_pwm_duty(uint8_t duty)
{
    uint32_t period = TIMER_CAR(TIMER8);
    uint32_t pulse = (duty * period) / 100;
    /* 更新占空比 */
    timer_channel_output_pulse_value_config(TIMER8, FAN_CHANNEL, pulse);
}

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_timer_init()
 * @功能描述: TIMER初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_timer_init(void)
{
    /*这三个TIMER是用于任务中断的*/
    gd32f4x_timer2_init(50);/*定时器2初始化,1ms定时中断一次 led6*/

	gd32f4x_timer4_init();/*定时器4初始化,100ms定时中断一次*/
	
	/*下面的两个TIMER是用于硬件中输出的分别控制蜂鸣器以及风扇的 led7 beep*/
	// gd32f4x_timer0_init(400,100,100,50);/*定时器0初始化*/

	gd32f4x_timer8_init(100,1000,50);/*定时器8初始化*/
}
uint32_t timer4irq_flag = 0;
uint32_t timer4irq_count = 0;
uint32_t timer4irq_count_flag = 0;
// uint32_t duty_data = 0;
/* ************************************************************************** */
/**
 * @函数名称: TIMER4_IRQHandler()
 * @功能描述: TIMER4 100mS中断
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void TIMER4_IRQHandler(void)
{
    uint32_t ulReturn;
    ulReturn = taskENTER_CRITICAL_FROM_ISR();
    if(SET == timer_interrupt_flag_get(TIMER4,TIMER_INT_UP))
	{
        /* 配合定时调试使用的 6.6调试 */
        // timer4irq_flag = 1;
        /* 呼吸灯测试 */        
        // if(duty_data == 100) {
        //     duty_data = 0;
        // }       
        // duty_data++;
        // printf("duty = %d\r\n",duty_data);
		timer_interrupt_flag_clear(TIMER4,TIMER_INT_UP);
    }   
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}



/* CAN************************************************************************** */
/* 初始化指针为空，防止野指针 */
static can0_receive_call_back_func can0_receive_call_back = NULL;
can0_error_handle_call_back_func can0_error_handle = NULL;

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_can0_init()
 * @功能描述: CAN0初始化
 * @输入: 波特率 ：baud
 *        500k  ：BAUD_500K
 *        250k  ：BAUD_250K
 *        100K  ：BAUD_100K
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can0_init(uint32_t baud)
{
    /* can0配置结构体 */
    can_parameter_struct can_parameter;
    /* can0时钟初始化 */
    rcu_periph_clock_enable(RCU_CAN0);
    /* can0引脚初始化 */
    rcu_periph_clock_enable(CAN0_RCU_CLOCK);
    /* CAN_TX */
    gpio_mode_set(CAN0_TX_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, CAN0_TX_PIN);
    gpio_output_options_set(CAN0_TX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, CAN0_TX_PIN);
    gpio_af_set(CAN0_TX_PORT, CAN0_TX_AF, CAN0_TX_PIN);
    /* CAN_RX */
    gpio_mode_set(CAN0_RX_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, CAN0_RX_PIN);
    gpio_af_set(CAN0_RX_PORT, CAN0_RX_AF, CAN0_RX_PIN);

    can_deinit(CAN0);
    /* can配置 */
    can_parameter.working_mode = CAN_NORMAL_MODE;
    can_parameter.resync_jump_width = CAN_BT_SJW_1TQ;
    can_parameter.time_segment_1 = CAN_BT_BS1_8TQ;
    can_parameter.time_segment_2 = CAN_BT_BS2_1TQ;
    can_parameter.time_triggered = DISABLE;
    can_parameter.auto_bus_off_recovery = ENABLE;
    can_parameter.auto_wake_up = ENABLE;
    can_parameter.rec_fifo_overwrite = ENABLE;
    can_parameter.trans_fifo_order = DISABLE;
    switch (baud) {
    case BAUD_100K:
        can_parameter.prescaler = 50;
        break;
    case BAUD_250K:
        can_parameter.prescaler = 20;
        break;
    case BAUD_500K:
        can_parameter.prescaler = 10;
        break;
     case BAUD_1000K:
        can_parameter.prescaler = 5;
        break;
    default:
        break;
    }
    can_init(CAN0, &can_parameter);

    can_filter_parameter_struct can_filter;

    /* 配置滤波器以接收所有消息 */
    can_filter.filter_number = 0;
    can_filter.filter_mode = CAN_FILTERMODE_MASK;
    can_filter.filter_bits = CAN_FILTERBITS_32BIT;
    can_filter.filter_list_high = 0x0000;
    can_filter.filter_list_low = 0x0000;
    can_filter.filter_mask_high = 0x0000;
    can_filter.filter_mask_low = 0x0000;
    can_filter.filter_fifo_number = CAN_FIFO0;
    can_filter.filter_enable = ENABLE;
    can_filter_init(&can_filter);

    nvic_irq_enable(CAN0_RX0_IRQn, 0, 4);
    can_interrupt_enable(CAN0, CAN_INT_RFNE0);

