YP-LXL/my-project/src/driver/gd32f4x.c
    // can_interrupt_disable(CAN0, CAN_INT_RFNE0);			/*失能CAN0接收非空中断*/
    // can_interrupt_disable(CAN0, CAN_INT_TME);			/*失能CAN0发送中断*/
}

void gd32f4x_can0_rx_irqn_enable(void)
{
    nvic_irq_enable(CAN0_RX0_IRQn, 1, 2);
}

void gd32f4x_can0_rx_irqn_disable(void)
{
    nvic_irq_disable(CAN0_RX0_IRQn);
}


/**
 * @函数名称: can0_check_whitelist_ef()
 * @功能描述: 允许通过can0的白名单扩展帧
 * @输入: 输入ID数组：filter_ids 输入id数量：num_filters
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t can0_check_whitelist_ef(uint32_t *filter_ids, uint8_t num_filters)
{
    /* 最大14个滤波器 */
    if (num_filters > MAX_FILTERS) {
        return 1; // 失败
    }
    can_filter_parameter_struct can_filter;
    uint8_t filter_number = 0;
    for (filter_number = 0; filter_number < num_filters; filter_number++) {
        can_filter.filter_number = filter_number;
        can_filter.filter_mode = CAN_FILTERMODE_MASK;
        can_filter.filter_bits = CAN_FILTERBITS_32BIT;
        can_filter.filter_list_high = (filter_ids[filter_number] >> 16) & 0xFFFF;
        can_filter.filter_list_low = filter_ids[filter_number] & 0xFFFF;
        can_filter.filter_mask_high = 0xFFFF;
        can_filter.filter_mask_low = 0x0000;
        can_filter.filter_fifo_number = CAN_FIFO0;
        can_filter.filter_enable = ENABLE;
        can_filter_init(&can_filter);
    }
    return 0; // 成功
}

/**
 * @函数名称: can0_receive_register()
 * @功能描述: can0接收数据注册函数
 * @输入: 输入一个函数
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t can0_receive_register(can0_receive_call_back_func call_back)
{
    if (call_back == NULL) {
        return 1; // 失败
    }
    if (can0_receive_call_back == NULL) {
        can0_receive_call_back = call_back;
    }
    return 0; // 成功
}

/**
 * @函数名称: can0_send_msg()
 * @功能描述: can0设备发送消息功能
 * @输入: canid:id 数据：data 长度：len
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t can0_send_msg(uint32_t id, uint8_t* data, uint8_t len)
{
    /* 先做长度判断以提前返回错误 */
    if (len > 8 || len == 0) {
        /* 长度错误 */
        return 1; // 失败
    }
    uint32_t error_count = 0;
    can_trasnmit_message_struct message;
    message.tx_sfid = 0;
    message.tx_efid = id;
    message.tx_ff = CAN_FF_EXTENDED;
    message.tx_ft = CAN_FT_DATA;
    message.tx_dlen = len;
    memcpy(message.tx_data, data, len);

    can_message_transmit(CAN0, &message);
    while (can_transmit_states(CAN0, 0) != CAN_TRANSMIT_OK) {
        error_count++;
        if (error_count >= 50000) {
            return 1; // 失败
        }
    }
    return 0; // 成功
}

/**
 * @函数名称: can0_error_handle_register()
 * @功能描述: can0错误处理注册函数
 * @输入: call_back - 错误处理回调函数
 * @输出: 无
 * @返回值: 0 - 注册成功, 1 - 注册失败
 */
uint8_t can0_error_handle_register(can0_error_handle_call_back_func call_back)
{
    if (call_back == NULL) {
        return 1; // 失败
    }
    if (can0_error_handle == NULL) {
        can0_error_handle = call_back;
    }
    return 0; // 成功
}

/**
 * @函数名称: can0_check_whitelist_sf()
 * @功能描述: can0白名单标准帧
 * @输入: filter_ids - 输入ID数组, num_filters - 输入ID数量
 * @输出: 无
 * @返回值: 0 - 注册成功, 1 - 注册失败
 */
uint8_t can0_check_whitelist_sf(uint32_t *filter_ids, uint8_t num_filters)
{
    /* 最大14个滤波器 */
    if (num_filters > MAX_FILTERS || num_filters <= MIN_FILTERS) {
        return 1; // 失败
    }
    can_filter_parameter_struct can_filter;
    uint8_t filter_number = 0;
    for (filter_number = 0; filter_number < num_filters; filter_number++) {
        can_filter.filter_number = filter_number;
        can_filter.filter_mode = CAN_FILTERMODE_MASK;
        /* 适配于标准帧处理 */
        can_filter.filter_bits = CAN_FILTERBITS_32BIT;
        /* 匹配高8位 */
        can_filter.filter_list_high = (filter_ids[filter_number] & 0x700) << 5;
        /* 不使用 */
        can_filter.filter_list_low = 0x0000;
        /* 掩码高3位有效 */
        can_filter.filter_mask_high = 0x0700 << 5;
        /* 不影响低位 */
        can_filter.filter_mask_low = 0x0000;
        can_filter.filter_fifo_number = CAN_FIFO0;
        can_filter.filter_enable = ENABLE;
        can_filter_init(&can_filter);
    }
    return 0; // 成功
}

T_CAN0_ERR_TYPDEF can0_err_param = {
    .init_flag      = CAN0_INIT_FLAG_NONE,          /* 初始化标志位 0未初始化 1初始化成功 2初始化失败 */
    .err_flag       = CAN0_ERR_NONE,                /* 发送错误标志位 0无 1错误（触发发送错误数阈值） */
    .no_communication_time_count = 0,               /* 无通信计时 */
    .no_communication_time_err_threshold = CAN0_ERR_NO_COMMUNICATION_TIME_THRESHOLD_DEFAULT, /* 无通信异常时间阈值s */
    .send_err_count = 0,                            /* 发送错误计数，成功一次清零，失败一次计数 */
    .send_err_num_threshold = CAN0_ERR_NUM_THRESHOLD_DEFAULT,/* 发送错误计数阈值，超过阈值置位发送错误标志位 */
    .err_callback = NULL,                           /* 异常回调 */
};


/**
 * @函数名称: can0_process_cycle()
 * @功能描述: can0周期处理函数，用于处理错误标志位，无通信时间计时，发送错误计数错误标志位
 * @输入: cycle_time:周期时间 单位s
 * @输出: 无
 * @返回值: 无
 */
 void can0_process_cycle(uint32_t cycle_time)
 {
    /* 计时器到达阈值，清除错误标志位 */
    if (can0_err_param.no_communication_time_count >= can0_err_param.no_communication_time_err_threshold) {
        can0_err_param.err_flag |= CAN0_ERR_NO_COMMUNICATION;
    } 
    else {
        can0_err_param.err_flag &= ~CAN0_ERR_NO_COMMUNICATION;
        can0_err_param.no_communication_time_count += cycle_time;
    }

    /* 发送错误计数超过阈值，置位错误标志位 */
    if (can0_err_param.send_err_count >= can0_err_param.send_err_num_threshold) {
        can0_err_param.err_flag |= CAN0_ERR_SEND;
    }
    else {
        can0_err_param.err_flag &= ~CAN0_ERR_SEND;
    }

    /* 错误回调处理 */
    if (can0_err_param.err_callback != NULL) {
        can0_err_param.err_callback(can0_err_param.err_flag);
    }
 }


/* 初始化指针为空，防止野指针 */
static can1_receive_call_back_func can1_receive_call_back = NULL;
can1_error_handle_call_back_func can1_error_handle = NULL;

/* ************************************************************************** */
/**
 * @函数名称: gd32f4x_can1_init()
 * @功能描述: CAN1初始化
 * @输入: 波特率 ：baud
 *        500k  ：BAUD_500K
 *        250k  ：BAUD_250K
 *        100K  ：BAUD_100K
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can1_init(uint32_t baud)
{/* can1配置结构体 */
    can_parameter_struct can_parameter;
    /* can1时钟初始化 */
    rcu_periph_clock_enable(RCU_CAN1);
    /* can1引脚初始化 */
    rcu_periph_clock_enable(CAN1_RCU_CLOCK);
    /* CAN_TX */
    gpio_mode_set(CAN1_TX_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, CAN1_TX_PIN);
    gpio_output_options_set(CAN1_TX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, CAN1_TX_PIN);
    gpio_af_set(CAN1_TX_PORT, CAN1_TX_AF, CAN1_TX_PIN);
    /* CAN_RX */
    gpio_mode_set(CAN1_RX_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, CAN1_RX_PIN);
    gpio_af_set(CAN1_RX_PORT, CAN1_RX_AF, CAN1_RX_PIN);
    can_deinit(CAN1);
    /* can配置 */
    can_parameter.working_mode = CAN_NORMAL_MODE;
    can_parameter.resync_jump_width = CAN_BT_SJW_1TQ;
    can_parameter.time_segment_1 = CAN_BT_BS1_8TQ;
    can_parameter.time_segment_2 = CAN_BT_BS2_1TQ;
    can_parameter.time_triggered = DISABLE;
    can_parameter.auto_bus_off_recovery = ENABLE;
    can_parameter.auto_wake_up = ENABLE;
    can_parameter.rec_fifo_overwrite = ENABLE;
    can_parameter.trans_fifo_order = DISABLE;
    switch (baud) {
    case BAUD_100K:
        can_parameter.prescaler = 50;
        break;
    case BAUD_250K:
        can_parameter.prescaler = 20;
        break;
    case BAUD_500K:
        can_parameter.prescaler = 10;
        break;
    case BAUD_1000K:
        can_parameter.prescaler = 5;
        break;
    default:
        break;
    }
    can_init(CAN1, &can_parameter);

    can_filter_parameter_struct can_filter;

    /* 配置滤波器以接收所有消息 */
    can_filter.filter_number = 15;
    can_filter.filter_mode = CAN_FILTERMODE_MASK;
    can_filter.filter_bits = CAN_FILTERBITS_32BIT;
    can_filter.filter_list_high = 0x0000;
    can_filter.filter_list_low = 0x0000;
    can_filter.filter_mask_high = 0x0000;
    can_filter.filter_mask_low = 0x0000;
    can_filter.filter_fifo_number = CAN_FIFO1;
    can_filter.filter_enable = ENABLE;
    can_filter_init(&can_filter);

    
