YP-LXL/my-project/src/driver/gd32f4x.c
    can_interrupt_enable(CAN1, CAN_INT_RFNE1);
    can_interrupt_enable(CAN1, CAN_INT_TME);
    nvic_irq_enable(CAN1_RX1_IRQn, 1, 2);
}

void gd32f4x_can1_rx_irqn_enable(void)
{
    nvic_irq_enable(CAN1_RX1_IRQn, 1, 2);
}

void gd32f4x_can1_rx_irqn_disable(void)
{
    nvic_irq_disable(CAN1_RX1_IRQn);
}

/**
 * @函数名称: CAN1_RX1_IRQHandler()
 * @功能描述: CAN1_RX1中断函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void CAN1_RX1_IRQHandler(void)
{
    /* 定义结构体 */
    can_receive_message_struct RxMessage = {0};
    uint32_t ulreturn;
    /* 临界保护 */
    ulreturn = taskENTER_CRITICAL_FROM_ISR(); 
    /* 接收数据到结构体 */
    can_message_receive(CAN1, CAN_FIFO1, &RxMessage);

    if (can1_receive_call_back != NULL) {
        if (can1_receive_call_back != NULL) {
            if(atcommand_can_flag == 1)
            {
                can1_send_msg(0x0C000000, RxMessage.rx_data, sizeof(RxMessage.rx_data)); 
            }
            /* can0_receive_call_back(&RxMessage); */
        }
        can1_receive_call_back(&RxMessage);
    }
    taskEXIT_CRITICAL_FROM_ISR(ulreturn); 
}


/**
 * @函数名称: can1_check_whitelist_ef()
 * @功能描述: 允许通过can1的白名单扩展帧
 * @输入: filter_ids - 输入ID数组, num_filters - 输入ID数量
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 失败
 */
uint8_t can1_check_whitelist_ef(uint32_t *filter_ids, uint8_t num_filters)
{
    /* 最大14个滤波器 */
    if (num_filters > MAX_FILTERS) {
        return 1; // 失败
    }
    can_filter_parameter_struct can_filter;
    uint8_t filter_number = 0;
    for (filter_number = 0; filter_number < num_filters; filter_number++) {
        can_filter.filter_number = filter_number;
        can_filter.filter_mode = CAN_FILTERMODE_MASK;
        can_filter.filter_bits = CAN_FILTERBITS_32BIT;
        can_filter.filter_list_high = (filter_ids[filter_number] >> 16) & 0xFFFF;
        can_filter.filter_list_low = filter_ids[filter_number] & 0xFFFF;
        can_filter.filter_mask_high = 0xFFFF;
        can_filter.filter_mask_low = 0x0000;
        can_filter.filter_fifo_number = CAN_FIFO1;
        can_filter.filter_enable = ENABLE;
        can_filter_init(&can_filter);
    }
    return 0; // 成功
}

/**
 * @函数名称: can1_receive_register()
 * @功能描述: can1接收数据注册函数
 * @输入: call_back - 接收回调函数
 * @输出: 无
 * @返回值: 0 - 注册成功, 1 - 注册失败
 */
uint8_t can1_receive_register(can1_receive_call_back_func call_back)
{
    if (call_back == NULL) {
        return 1; // 失败
    }
    if (can1_receive_call_back == NULL) {
        can1_receive_call_back = call_back;
    }
    return 0; // 成功
}

/**
 * @函数名称: can1_send_msg()
 * @功能描述: can1设备发送消息功能
 * @输入: id - CAN ID, data - 数据, len - 数据长度
 * @输出: 无
 * @返回值: 0 - 成功, 1 - 长度超长, 2 - 发送失败
 */
uint8_t can1_send_msg(uint32_t id, uint8_t* data, uint8_t len)
{
    /* 先做长度判断以提前返回错误 */
    if (len > 8 || len == 0) {
        /* 长度错误 */
        return 1; // 长度超长
    }
    uint32_t error_count = 0;
    can_trasnmit_message_struct message;
    /* 设置消息结构体参数 */
    message.tx_sfid = 0;
    /* 通常扩展ID设为0 */
    message.tx_efid = id;
    /* 标准帧 */
    message.tx_ff = CAN_FF_EXTENDED;
    /* 数据帧 */
    message.tx_ft = CAN_FT_DATA;
    message.tx_dlen = len;
    memcpy(message.tx_data, data, len);
    /* 发送消息 */
    can_message_transmit(CAN1, &message);
    /* 轮询等待发送完成，带有限制的重试机制 */
    while (can_transmit_states(CAN1, 0) != CAN_TRANSMIT_OK) {
        error_count++;
        if (error_count >= 50000) {
            return 2; // 发送失败
        }
    }
    return 0; // 成功
}

/**
 * @函数名称: can1_error_handle_register()
 * @功能描述: can1错误处理注册函数
 * @输入: call_back - 错误处理回调函数
 * @输出: 无
 * @返回值: 0 - 注册成功, 1 - 注册失败
 */
uint8_t can1_error_handle_register(can1_error_handle_call_back_func call_back)
{
    if (call_back == NULL) {
        return 1; // 失败
    }
    if (can1_error_handle == NULL) {
        can1_error_handle = call_back;
    }
    return 0; // 成功
}

/**
 * @函数名称: can1_check_whitelist_sf()
 * @功能描述: can1白名单标准帧
 * @输入: filter_ids - 输入ID数组, num_filters - 输入ID数量
 * @输出: 无
 * @返回值: 0 - 注册成功, 1 - 注册失败
 */
uint8_t can1_check_whitelist_sf(uint32_t *filter_ids, uint8_t num_filters)
{
    /* 最大14个滤波器 */
    if (num_filters > MAX_FILTERS || num_filters <= MIN_FILTERS) {
        return 1; // 失败
    }
    can_filter_parameter_struct can_filter;
    uint8_t filter_number = 0;
    for (filter_number = 0; filter_number < num_filters; filter_number++) {
        can_filter.filter_number = filter_number;
        can_filter.filter_mode = CAN_FILTERMODE_MASK;
        /* 适配于标准帧处理 */
        can_filter.filter_bits = CAN_FILTERBITS_32BIT;
        /* 匹配高8位 */
        can_filter.filter_list_high = (filter_ids[filter_number] & 0x700) << 5;
        /* 不使用 */
        can_filter.filter_list_low = 0x0000;
        /* 掩码高3位有效 */
        can_filter.filter_mask_high = 0x0700 << 5;
        /* 不影响低位 */
        can_filter.filter_mask_low = 0x0000;
        can_filter.filter_fifo_number = CAN_FIFO1;
        can_filter.filter_enable = ENABLE;
        can_filter_init(&can_filter);
    }
    return 0; // 成功
}


/* 看门狗************************************************************************** */
/**
 * @函数名称: gd32f4x_fwdgt_init()
 * @功能描述: 独立看门狗初始化
 * @输入: prer:分频数:FWDGT_PSC_DIV4~FWDGT_PSC_DIV256
 *        分频因子 = 4 * 2^prer. 但最大值只能是256!
 *        rlr:自动重装载值,0~0XFFF.
 *        时间计算(大概):Tout=((4 * 2^) * rlr) / 32 (ms).
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_fwdgt_init(uint8_t prer, uint16_t rlr)
{
    /* 配置独立看门狗定时器 */
    fwdgt_write_enable();
    fwdgt_config(rlr, prer);
    fwdgt_counter_reload();
    fwdgt_enable();
}

/**
 * @函数名称: gd32f4x_fwdgt_feed()
 * @功能描述: 独立看门狗喂狗
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_fwdgt_feed(void)
{
    fwdgt_counter_reload();
}

void gd32f4x_fwdgt_disable(void)
{

}

/**
 * @函数名称: gd32f4x_wwdgt_init()
 * @功能描述: 窗口看门狗初始化
 * @输入: tr: T[6:0],计数器值 wr: W[6:0],窗口值
 *            fprer:分频系数,范围:WWDGT_CFG_PSC_DIV1 ~WWDGT_CFG_PSC_DIV8
 *            Fwwdg = PCLK1 / (4096 * 2^fprer). 一般PCLK1=50Mhz
 *            溢出时间 = (4096 * 2^fprer) * (tr - 0X3F) / PCLK1
 *            假设fprer = WWDGT_CFG_PSC_DIV8, tr = 7f, PCLK1 = 50Mhz
 *            则溢出时间 = 4096 * 8 * 64 / 50Mhz = 41.94ms
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_wwdgt_init(uint16_t tr, uint8_t wr, uint32_t fprer)
{
    /* 使能WWDGT时钟 */
    rcu_periph_clock_enable(RCU_WWDGT);
    /* 设置WWDGT计数器值、窗口值和预分频值 */
    wwdgt_config(tr, wr, fprer);
    /* 使能窗口看门狗定时器 */
    wwdgt_enable();
    /* 清除WWDGT提前唤醒中断标志位状态 */
    wwdgt_flag_clear();
    /* 使能窗口看门狗提前唤醒中断 */
    wwdgt_interrupt_enable();
    /* 抢占优先级2，响应优先级为3 */
    nvic_irq_enable(WWDGT_IRQn, 2, 3);
}

/**
 * @函数名称: gd32f4x_fwdgt_init_ms()
 * @功能描述: 独立看门狗溢出时间设置(最大32秒),设置独立看门狗后
 *           系统进入睡眠状态，长时间不喂狗会导致系统复位，这个
 *           问题在此处无法解决，后续采用RTC中断喂狗的方式，就不
 *           会产生这种问题。
 * @输入: tout_ms：毫秒
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_fwdgt_init_ms(uint32_t tout_ms)
{
    if (tout_ms == 0) {
        tout_ms = 7.8125;
    }
    uint16_t rlr = (uint16_t)(tout_ms / 7.8125);
    if (rlr > 0xFFF) {
        rlr = 0xFFF;
    }
    gd32f4x_fwdgt_init(FWDGT_PSC_DIV256, rlr);
}

/**
 * @函数名称: gd32f4x_wwdgt_init_ms()
 * @功能描述: 窗口看门狗溢出时间设置
 * @输入: tout_ms：毫秒
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_wwdgt_init_ms(uint32_t tout_ms)
{
    if(tout_ms>=41) {
        tout_ms=41;
    }
    if(tout_ms<=0) {
        tout_ms=1;
    }
    uint32_t temp=50000*tout_ms;

    uint16_t tr = (temp/32768)+63;
    
