YP-LXL/my-project/src/driver/gd32f4x.c
    gd32f4x_wwdgt_init(tr, 0X5F, WWDGT_CFG_PSC_DIV8);
}

/**
 * @函数名称: WWDGT_IRQHandler()
 * @功能描述: 窗口看门狗中断喂狗
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void WWDGT_IRQHandler(void)
{
    if (wwdgt_flag_get() != RESET) {
       wwdgt_counter_update(0x7F);
    }
    wwdgt_flag_clear();
}

/* RTC************************************************************************** */
rtc_parameter_struct rtc_time_structure;

/**
 * @函数名称: gd32f4x_rtc_init()
 * @功能描述: RTC时钟外设初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 0: 成功 -1：外部晶振未就绪 -2：同步失败
 */
int gd32f4x_rtc_init(void) 
{
    /**** 使能时钟单元 *****/
    /* 使能PMU电源管理单元时钟 */
    rcu_periph_clock_enable(RCU_PMU);
    /* 使能电源备份源，置位BKPWEN位 */
    pmu_backup_write_enable();

    /***配置外部时钟***/
    /* 使用外部晶振32.768K */
    rcu_osci_on(RCU_LXTAL); 
    /* 等待振荡器稳定标志位置位或振荡器起振超时 */
    if (rcu_osci_stab_wait(RCU_LXTAL) != SUCCESS) {
        /* 外部晶振未就绪 */
        return -1; 
    }
    /* 配置RTC时钟源为外部晶振32.768K */
    rcu_rtc_clock_config(RCU_RTCSRC_LXTAL);
    /* 设置分频 */
    rtc_time_structure.factor_asyn = 0X7F;
    rtc_time_structure.factor_syn = 0XFF;
    /* 使能RTC外设时钟 */
    rcu_periph_clock_enable(RCU_RTC);
    /* 等待RTC寄存器(RTC_TIME、RTC_DATE)与RTC的APB时钟同步 */
    if (rtc_register_sync_wait() != SUCCESS) {
        /* 同步失败 */
        return -2; 
    }
    #ifdef RTC_ALARM
    /* rtc闹钟中断初始化 */
    gd32f4x_rtc_init_alarm_interrupt();
    #endif
    #ifdef RTC_WEAKUP
    /* rtc自动唤醒定时器初始化 */
    gd32f4x_rtc_wakeup_init(0x0010);
    #endif
    
    return 0;
}

/**
 * @函数名称: gd32f4x_rtc_init_alarm_interrupt()
 * @功能描述: RTC闹钟中断配置
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_rtc_init_alarm_interrupt(void)
{    
    /* 使能中断 */
    rtc_interrupt_enable(RTC_INT_ALARM0);
    rtc_flag_clear(RTC_FLAG_ALRM0);
    exti_flag_clear(EXTI_17);
    exti_init(EXTI_17,EXTI_INTERRUPT,EXTI_TRIG_RISING);
    nvic_irq_enable(RTC_Alarm_IRQn,0,0); 
}

/**
 * @函数名称: gd32f4x_rtc_wakeup_init()
 * @功能描述: RTC自动唤醒定时器初始化
 * @输入: wakup_time_s 唤醒时间 单位s
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_rtc_wakeup_init(uint16_t wakup_time_s)
{
    rtc_wakeup_disable();
    /* 清空中断标志 */
    rtc_flag_clear(RTC_FLAG_WT);
    exti_flag_clear(EXTI_22);
    
    exti_interrupt_flag_clear(EXTI_22);    
    nvic_irq_enable(RTC_WKUP_IRQn, 3U, 0U);
    /* 上升沿 */
    exti_init(EXTI_22, EXTI_INTERRUPT, EXTI_TRIG_RISING); 
    /* 设置RTC自动唤醒定时器时钟 */
    rtc_wakeup_clock_set(WAKEUP_CKSPRE); 
    /* 自动唤醒定时器重载值 */
    rtc_wakeup_timer_set(wakup_time_s); 
    rtc_wakeup_enable();
    /* 使能中断 */
    rtc_interrupt_enable(RTC_INT_WAKEUP);
}

/**
 * @函数名称: RTC_Alarm_IRQHandler()
 * @功能描述: RTC闹钟中断服务函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void RTC_Alarm_IRQHandler(void)
{
    if (rtc_flag_get(RTC_FLAG_ALRM0) != RESET) {
        #ifdef RTC_PRINTF
        printf("alarm interrupt triggered!!!!\r\n");
        #endif
        exti_interrupt_flag_clear(EXTI_17);        
        rtc_flag_clear(RTC_FLAG_ALRM0);
    }
}

/**
 * @函数名称: RTC_WKUP_IRQHandler()
 * @功能描述: RTC自动定时唤醒中断服务函数
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void RTC_WKUP_IRQHandler(void)
{
    if (rtc_flag_get(RTC_FLAG_WT) != RESET) {
        #ifdef RTC_PRINTF
        printf("Wakeup timer interrupt triggered!\r\n");
        #endif
        rtc_flag_clear(RTC_FLAG_WT);
        exti_flag_clear(EXTI_22);
    }
}

/**
 * @函数名称: gd32f4x_mcu_sleep_enter()
 * @功能描述: mcu低功耗模式使能
 * @输入: 枚举变量三种模式：睡眠模式、深度睡眠模式、待机模式
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_mcu_sleep_enter(MCU_SLEEP_MODE_TYPEDEF mode)
{
    rcu_periph_clock_enable(RCU_PMU);
    switch (mode) {
    case MCU_MODE_SLEEP:
        pmu_to_sleepmode(WFI_CMD);
        break;
    case MCU_MODE_DEEP_SLEEP:
        pmu_to_deepsleepmode(PMU_LDO_LOWPOWER, WFI_CMD);
        break;
    case MCU_MODE_STANDBY:
        pmu_to_standbymode(WFI_CMD);
        break;
    default:
        break;
    }
}

/**
 * @函数名称: gd32f4x_after_sleep_init_func()
 * @功能描述: 深度睡眠后要恢复时钟频率（只有深度睡眠的时候才需要使用）
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_after_sleep_init_func(void)
{
    gd32f4x_system_clock_init();
}

gd32f4x_after_sleep_init_call_back gd32f4x_after_sleep_init;

/**
 * @函数名称: gd32f4x_after_sleep_init_register()
 * @功能描述: 深度睡眠后要恢复时钟频率注册
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
uint8_t gd32f4x_after_sleep_init_register(gd32f4x_after_sleep_init_call_back call_back)
{
    if (call_back == NULL) {
        return -1;
    }
    if (gd32f4x_after_sleep_init == NULL) {
        gd32f4x_after_sleep_init = call_back;
    }
    return 1;
}

/**
 * @函数名称: gd32f4x_key_wakeup_init()
 * @功能描述: 按键唤醒初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_key_wakeup_init(void)
{
    rcu_periph_clock_enable(RCU_SYSCFG);
    rcu_periph_clock_enable(KEY_WAKEUP_PIN_PERIPH);
    gpio_mode_set(KEY_WAKEUP_PORT, GPIO_MODE_INPUT, GPIO_PUPD_NONE, KEY_WAKEUP_PIN);
    syscfg_exti_line_config(KEY_WAKEUP_EXTI_PORT, KEY_WAKEUP_EXTI_PIN);
    exti_init(KEY_WAKEUP_EXTI, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
    exti_flag_clear(KEY_WAKEUP_EXTI);
    exti_interrupt_enable(EXTI_2);
    /* 按键中断的引脚和CAN引脚接在一起，CAN电信号进入后
        反转按键的引脚去复位，这个基于目前的硬件环境，CAN唤醒没有测
        使用的时候不要发送也不要接收，否则会频繁唤醒MCU，无法进入睡眠 */
    nvic_irq_enable(EXTI2_IRQn, 2, 3);
    pmu_wakeup_pin_enable();
}

/**
 * @函数名称: EXTI2_IRQHandler()
 * @功能描述: 按键中断
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void EXTI2_IRQHandler(void)
{
	uint32_t ulReturn;
	ulReturn = taskENTER_CRITICAL_FROM_ISR();
	if(exti_interrupt_flag_get(EN_SKY_EXTI_X) == SET)
	{
        DRIVER_LOG(" KEY INPUT \r\n");
        if (gd32f4x_after_sleep_init != NULL) {
            gd32f4x_after_sleep_init();
        }
		exti_interrupt_flag_clear(EN_SKY_EXTI_X);
	}
	taskEXIT_CRITICAL_FROM_ISR(ulReturn);
}

/**
 * @函数名称: gd32f4x_key_wakeup_enable()
 * @功能描述: 按键唤醒使能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_key_wakeup_enable(void)
{
    exti_interrupt_enable(EXTI_2);
    pmu_wakeup_pin_enable();
}

/**
 * @函数名称: gd32f4x_key_wakeup_disable()
 * @功能描述: 按键唤醒失能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_key_wakeup_disable(void)
{
    pmu_wakeup_pin_disable();
    exti_interrupt_disable(EXTI_2);
}

/**
 * @函数名称: gd32f4x_can0_wakeup_init()
 * @功能描述: can0设备唤醒初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can0_wakeup_init(void)
{
    // gd32f4x_can0_init(BAUD_500K);
    can_interrupt_enable(CAN0, CAN_INT_WAKEUP);
}

/**
 * @函数名称: gd32f4x_can0_wakeup_enable()
 * @功能描述: can0设备唤醒使能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can0_wakeup_enable(void)
{
    can_interrupt_enable(CAN0, CAN_INT_WAKEUP);
}

/**
 * @函数名称: gd32f4x_can0_wakeup_disable()
 * @功能描述: can0设备唤醒失能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can0_wakeup_disable(void)
{
    can_interrupt_disable(CAN0, CAN_INT_WAKEUP);
}


/**
 * @函数名称: gd32f4x_can1_wakeup_init()
 * @功能描述: can1设备唤醒初始化
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can1_wakeup_init(void)
{
    // gd32f4x_can1_init(BAUD_500K);
    can_interrupt_enable(CAN1, CAN_INT_WAKEUP);
}

/**
 * @函数名称: gd32f4x_can1_wakeup_enable()
 * @功能描述: can1设备唤醒使能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can1_wakeup_enable(void)
{
    can_interrupt_enable(CAN1, CAN_INT_WAKEUP);
}

/**
 * @函数名称: gd32f4x_can1_wakeup_disable()
 * @功能描述: can1设备唤醒失能
 * @输入: 无
 * @输出: 无
 * @返回值: 无
 */
void gd32f4x_can1_wakeup_disable(void)
{
    can_interrupt_disable(CAN1, CAN_INT_WAKEUP);
}

/*IIC************************************************************/
uint8_t iic1_delay_rate = 0;
 /**
 * @函数名称: gd32f4x_i2c1_init()
 * @功能描述: 设置IIC1口初始化 AFE
 * @输入: clock 是频率（单位：Hz）
 * @输出: 无
 * @返回值: 0:初始化成功；1：初始化失败
 */
uint8_t gd32f4x_i2c1_init(uint32_t clock)
{    
	uint8_t retval = 0;
	uint32_t delay_us = 0;

    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_GPIOD);

