YP-LXL/my-project/src/driver/gd32f4x.c
    gpio_mode_set(IIC1_PORT_SCL, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, IIC1_PIN_SCL);
    gpio_output_options_set(IIC1_PORT_SCL, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, IIC1_PIN_SCL);
     
    gpio_mode_set(IIC1_PORT_SDA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, IIC1_PIN_SDA);
    gpio_output_options_set(IIC1_PORT_SDA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, IIC1_PIN_SDA);
    
	if (clock > 0) {
		/* 计算每个周期的延时， clock 是频率（单位：Hz）*/
		delay_us = 2000000 / clock; 
	}
	iic1_delay_rate = delay_us;
    // printf(" system_clock  %ld delay_us = %ld \r\n",rcu_clock_freq_get(CK_APB1),delay_us);  /* 打印系统时钟*/
	return retval;

}
 /**
 * @函数名称: gd32f4x_spi_init()
 * @功能描述: 设置SPI口初始化 
 * @输入: 无
 * @输出: 无
 * @返回值: 0:初始化成功；1：初始化失败
 */
uint8_t gd32f4x_spi_init(void)
{
	uint8_t retval = 0;
     
	/* 启用GPIO时钟*/
    rcu_periph_clock_enable(SPI_RCU_CLOCK);

	/* 配置SCLK引脚 (SPI时钟线)*/
	gpio_mode_set(SPI_PORT_SCLK, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, SPI_PIN_SCLK);  /* 配置为输出*/
	gpio_output_options_set(SPI_PORT_SCLK, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, SPI_PIN_SCLK);  /* 配置为推挽输出，50MHz速度*/
	
	/* 配置MOSI引脚 (SPI主输出从输入)*/
	gpio_mode_set(SPI_PORT_MOSI, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, SPI_PIN_MOSI);  /*配置为输出*/
	gpio_output_options_set(SPI_PORT_MOSI, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, SPI_PIN_MOSI);  /* 配置为推挽输出，50MHz速度*/
	
	/* 配置MISO引脚 (SPI主输入从输出)*/
	gpio_mode_set(SPI_PORT_MISO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, SPI_PIN_MISO);  /*配置为输入*/
	/* 如果需要带上上拉或下拉电阻，可以修改 `GPIO_PUPD_NONE` 为 `GPIO_PUPD_PULLUP` 或 `GPIO_PUPD_PULLDOWN`
	 例如：gpio_mode_set(SPI_PORT_MISO, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, SPI_PIN_MISO);*/
	
	/* 配置CS引脚 (SPI片选线)*/
	gpio_mode_set(SPI_PORT_CS, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, SPI_PIN_CS);  /* 配置为输出*/
	gpio_output_options_set(SPI_PORT_CS, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, SPI_PIN_CS);  /*配置为推挽输出，50MHz速度*/
	
    gpio_bit_set(SPI_PORT_CS,SPI_PIN_CS); /*拉高片选，空闲状态	*/

	return retval;
}


/* 发送单个比特*/
uint8_t spi_send_bit(uint8_t data)
{
    uint8_t retval = 0;

    /* MSB，最高有效位发送数据*/
    if (data == 1)
        FLSH_SPI_MOSI(1); /* 输出高电平*/
    else
        FLSH_SPI_MOSI(0); /* 输出低电平*/

    /* 设置SCLK引脚为低电平，这个时候，从机开始读取MOSI引脚电平*/
    FLSH_SPI_SCLK(0); /* 输出低电平*/
    FLSH_SPI_US_DELAY();

    /* 设置SCLK引脚为高电平，告诉从机，主机准备采集MISO电平*/
    FLSH_SPI_SCLK(1); /* 输出高电平*/
    FLSH_SPI_US_DELAY();

    /* 主机采集MISO引脚电平*/
    if (FLSH_SPI_READ_SDA())
        retval = 1;

    return retval;
}

/* 发送一个字节*/
uint8_t spi_send_byte(uint8_t data)
{
    int32_t i = 0;
    uint8_t retval = 0;

    /* 发送字节，每次发送一个比特*/
    for (i = 7; i >= 0; i--)
    {
        retval |= (spi_send_bit((data >> i) & 1) << i); /* 发送bit并更新返回值*/
    }

    return retval;
}

/* 发送一个半字（16位）*/
uint16_t spi_send_halfword(uint16_t data)
{
    int32_t i = 0;
    uint16_t retval = 0;

    /* 发送半字，每次发送一个比特*/
    for (i = 15; i >= 0; i--)
    {
        retval |= (spi_send_bit((data >> i) & 1) << i); /* 发送bit并更新返回值*/
    }

    return retval;
}

/* 接收单个比特*/
uint8_t spi_receive_bit(void)
{
    uint8_t retval = 0;

    /*设置SCLK引脚为低电平，等待从机准备数据*/
    FLSH_SPI_SCLK(0); /* 输出低电平*/
    FLSH_SPI_US_DELAY();

    /* 设置SCLK引脚为高电平，准备采集数据*/
    FLSH_SPI_SCLK(1); /* 输出高电平*/
    FLSH_SPI_US_DELAY();

    /* 采集MISO引脚电平*/
    if (FLSH_SPI_READ_SDA())
        retval = 1; /* 从MISO读取到1*/
    else
        retval = 0; /* 从MISO读取到0*/

    return retval;
}

/* 接收一个字节*/
uint8_t spi_receive_byte(void)
{
    int32_t i = 0;
    uint8_t retval = 0;

    /* 接收字节，每次接收一个比特*/
    for (i = 7; i >= 0; i--)
    {
        retval |= (spi_receive_bit() << i); /* 接收bit并更新返回值*/
    }

    return retval;
}



/* 接收一个半字（16位）*/
uint16_t spi_receive_halfword(void)
{
    int32_t i = 0;
    uint16_t retval = 0;

    /* 接收半字，每次接收一个比特*/
    for (i = 15; i >= 0; i--)
    {
        retval |= (spi_receive_bit() << i); /* 接收bit并更新返回值*/
    }

    return retval;
}


struct McuInfo_t
{
	union
	{
		uint32_t Size;
		struct
		{
			uint16_t FlashSize;
			uint16_t SramSize;
		};
	}Storage;
	uint8_t UniqueId[12];
}McuInfo;

void gd32f4x_read_id(void)
{
    uint8_t i = 0;
    McuInfo.Storage.Size=*(uint32_t*)STORAGE_INFO;
    printf("sram size=%dk\r\n\r\n",McuInfo.Storage.SramSize);
    printf("flash size=%dk\r\n\r\n",McuInfo.Storage.FlashSize);
    printf("unique id:[");
    for(i=0;i<12;i++)
    {
        McuInfo.UniqueId[i]=*(uint8_t*)(UNIQUE_ID+i);
        printf(" %02x",McuInfo.UniqueId[i]);
    }
    printf("]\r\n");
}


/**
 * @brief   通过软件 SPI 同时发送并接收一个字节
 * @param   dat  要发送的字节
 * @return  接收到的字节
 */
uint8_t spi_read_write_byte(uint8_t data)
{
    uint8_t recv = 0;
    /* 从最高位到最低位 */
    for (int8_t i = 7; i >= 0; i--) {
        /* spi_send_bit 会：
         *   1) 把 (dat>>i)&1 写到 MOSI
         *   2) 拉低——延时——拉高产生时钟
         *   3) 读取 MISO 并返回这一位
         */
        recv |= (spi_send_bit((data >> i) & 1) << i);
    }
    return recv;
}

uint16_t rs485_datacrc16(uint8_t *puchMsg, uint16_t usDataLen)
{
    uint16_t CRC_high = 0xFF;    
    uint16_t CRC_low = 0xFF;    
    uint32_t Index;             

    /* 传输消息缓冲区*/
    while (usDataLen--)
    {
		if(puchMsg != NULL)
		{
			Index = CRC_high^*puchMsg++;   /*计算CRC*/
			CRC_high = CRC_low ^ ExternalCommRxA_CRCTable_high[Index];
			CRC_low = ExternalCommRxA_CRCTable_low[Index];
		}
		else
		{
			CRC_high = 0xFF;
			CRC_low = 0xFF;
			break;
		}
    }
    /*返回CRC校验值*/
    return (CRC_high  | (CRC_low<<8));/*return ((CRC_high << 8) | CRC_low);*/
}




